import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2015() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="베테랑 🥇"
                    image="https://movie-phinf.pstatic.net/20150622_131/14349365467550iQnC_JPEG/movie_image.jpg"
                    link="https://youtu.be/hcKp68DtBb0"
                    release="2015.08.05."
                    audience={13414484}
                    tmeter={90} tscore={78}
                    mscore={0} mreview={7.6}
                    boxoffice={94393020}
                    award="15청룡, 16백상예술대상 감독상"
                    actor="황정민(서도철), 유아인(조태오), 유해진(최상무)"
                    story="한 번 꽂힌 것은 무조건 끝을 보는 행동파 ‘서도철’(황정민),
                    20년 경력의 승부사 ‘오팀장’(오달수), 위장 전문 홍일점 ‘미스봉’(장윤주), 육체파 ‘왕형사’(오대환), 막내 ‘윤형사’(김시후)까지
                    겁 없고, 못 잡는 것 없고, 봐 주는 것 없는 특수 강력사건 담당 광역수사대. 오랫동안 쫓던 대형 범죄를 해결한 후 숨을 돌리려는 찰나,
                    서도철은 재벌 3세 ‘조태오’(유아인)를 만나게 된다. 세상 무서울 것 없는 안하무인의 조태오와 언제나 그의 곁을 지키는 오른팔 ‘최상무’(유해진).
                    서도철은 의문의 사건을 쫓던 중 그들이 사건의 배후에 있음을 직감한다. 건들면 다친다는 충고에도 불구하고 포기하지 않는 서도철의 집념에
                    판은 걷잡을 수 없이 커져가고 조태오는 이를 비웃기라도 하듯 유유히 포위망을 빠져 나가는데…"
                />
                <Movie
                    rank="2"
                    name="암살 🥈"
                    image="https://movie-phinf.pstatic.net/20150713_74/14367488229802tA3J_JPEG/movie_image.jpg"
                    link="https://youtu.be/RnGxpZ75zFU"
                    release="2015.07.22."
                    audience={12706829}
                    tmeter={0} tscore={0}
                    mscore={64} mreview={6.8}
                    boxoffice={96119773}
                    award="16백상예술대상 영화작품상"
                    actor="전지현(안옥윤), 이정재(염석진), 하정우(하와이 피스톨)"
                    story="1933년 조국이 사라진 시대 대한민국 임시정부는 일본 측에 노출되지 않은 세 명을 암살작전에 지목한다.
                    한국 독립군 저격수 안옥윤, 신흥무관학교 출신 속사포, 폭탄 전문가 황덕삼! 김구의 두터운 신임을 받는 임시정부 경무국 대장 염석진은 이들을 찾아 나서기 시작한다.
                    암살단의 타깃은 조선주둔군 사령관 카와구치 마모루와 친일파 강인국.
                    한편, 누군가에게 거액의 의뢰를 받은 청부살인업자 하와이 피스톨이 암살단의 뒤를 쫓는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="어벤져스: 에이지 오브 울트론 🥉"
                    image="https://movie-phinf.pstatic.net/20150324_33/1427159150181p9uQM_JPEG/movie_image.jpg"
                    link="https://youtu.be/xmYifU6bjro"
                    release="2015.04.23."
                    audience={10504007}
                    tmeter={76} tscore={83}
                    mscore={66} mreview={7.0}
                    boxoffice={1402809540}
                    award="슈퍼 히어로 영화 최초 1000만 관객 돌파"
                    actor="로버트 다우니 주니어(토니 스타크/아이언맨), 크리스 헴스워스(토르)"
                    story="쉴드의 숙적 히드라는 연구를 통해 새로운 능력자 막시모프 남매를 탄생시키고, 히드라의 기지를 공격하는 도중 토니 스타크는 완다 막시모프의 
                    초능력으로 인해 자신이 가장 두려워하는 미래를 보게 된다. 이에 '뉴욕전쟁' 때와 같은 사태가 벌어지지 않도록 스타크는 배너 박사와 함께 지구를 지킬 
                    최강의 인공지능 울트론을 탄생시키게 되지만, 울트론은 예상과 다르게 지배를 벗어나 폭주하기 시작하는데..."
                />
                <Movie
                    rank="4"
                    name="히말라야"
                    image="https://movie-phinf.pstatic.net/20151119_280/1447895561914GiahL_JPEG/movie_image.jpg"
                    link="https://youtu.be/9FS0YFIJU7Q"
                    release="2015.12.16."
                    audience={7759711}
                    tmeter={43} tscore={56}
                    mscore={0} mreview={0}
                    boxoffice={50544493}
                    award="16백상예술대상 여자조연상"
                    actor="황정민(엄홍길), 정우(박무택)"
                    story="해발 8,750 미터 히말라야 에베레스트 데스존. 인간의 접근을 허락하지 않은 신의 영역. 그곳에 우리 동료가 묻혀있다.
                    산 아래 하나였고, 또 다른 가족이었던 사람들 생을 마감한 후배 대원의 시신을 찾기 위해 기록도, 명예도, 보상도 없는 가슴 뜨거운 여정을 시작한다.
                    그 누구도 시도하지 않았던 위대한 도전, 엄홍길 대장과 휴먼원정대의 감동 실화가 공개된다!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="내부자들"
                    image="https://movie-phinf.pstatic.net/20151021_172/14453964781624mCqX_JPEG/movie_image.jpg"
                    link="https://youtu.be/UCduDb1Pb0A"
                    release="2015.11.19."
                    audience={7073581}
                    tmeter={0} tscore={82}
                    mscore={0} mreview={0}
                    boxoffice={61653908}
                    award="16대종상영화제 5관왕"
                    actor="이병헌(안상구), 조승우(우장훈), 백윤식(이강희)"
                    story="유력한 대통령 후보와 재벌 회장, 그들을 돕는 정치깡패 안상구(이병헌). 뒷거래의 판을 짠 이는 대한민국 여론을 움직이는 유명 논설주간 이강희(백윤식)다.
                    더 큰 성공을 원한 안상구는 이들의 비자금 파일로 거래를 준비하다 발각되고, 이 일로 폐인이 되어 버려진다. 빽 없고 족보가 없어 늘 승진을 눈 앞에 두고 주저 앉는 검사 우장훈(조승우).
                    마침내 대선을 앞둔 대대적인 비자금 조사의 저격수가 되는 기회를 잡는다. 그러나 비자금 파일을 가로챈 안상구 때문에 수사는 종결되고,
                    우장훈은 책임을 떠안고 좌천된다. 자신을 폐인으로 만든 일당에게 복수를 계획하는 정치깡패 안상구.
                    비자금 파일과 안상구라는 존재를 이용해 성공하고 싶은 무족보 검사 우장훈.
                    그리고 비자금 스캔들을 덮어야 하는 대통령 후보와 재벌, 그들의 설계자 이강희. 과연 살아남는 자는 누가 될 것인가?"
                />
                <Movie
                    rank="6"
                    name="사도"
                    image="https://movie-phinf.pstatic.net/20150914_288/1442205739961ASv5B_JPEG/movie_image.jpg"
                    link="https://youtu.be/MJnromBupnQ"
                    release="2015.09.16."
                    audience={6247745}
                    tmeter={0} tscore={77}
                    mscore={0} mreview={0}
                    boxoffice={42165755}
                    award="15청룡영화상 4관왕 , 외 7관왕"
                    actor="송강호(영조), 유아인(사도세자), 문근영(혜경궁 홍씨)"
                    story="재위기간 내내 왕위계승 정통성 논란에 시달린 영조는 학문과 예법에 있어 완벽한 왕이 되기 위해 끊임없는 노력을 기울인다.
                    뒤늦게 얻은 귀한 아들 세자만은 모두에게 인정받는 왕이 되길 바랐지만 기대와 달리 어긋나는 세자에게 실망하게 된다.
                    어린 시절 남다른 총명함으로 아버지 영조의 기쁨이 된 아들. 아버지와 달리 예술과 무예에 뛰어나고 자유분방한 기질을 지닌 사도는
                    영조의 바람대로 완벽한 세자가 되고 싶었지만 자신의 진심을 몰라주고 다그치기만 하는 아버지를 점점 원망하게 된다.
                    왕과 세자로 만나 아버지와 아들의 연을 잇지 못한 운명, 역사상 가장 비극적인 가족사가 시작된다."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="킹스맨: 시크릿 에이전트"
                    image="https://movie-phinf.pstatic.net/20150211_196/1423620617966V1jPW_JPEG/movie_image.jpg"
                    link="https://youtu.be/SW6EKneLyCI"
                    release="2015.02.11."
                    audience={6129651}
                    tmeter={75} tscore={84}
                    mscore={60} mreview={8.1}
                    boxoffice={414351546}
                    award="15 Empire Award for Best British Film"
                    actor="콜린 퍼스(해리), 태런 에저튼(에그시), 사무엘 L. 잭슨(발렌타인)"
                    story="높은 IQ, 주니어 체조대회 2년 연속 우승! 그러나 학교 중퇴, 해병대 중도 하차.
                    동네 패싸움에 직장은 가져본 적도 없이 별볼일 없는 루저로 낙인 찍혔던 ‘그’가‘젠틀맨 스파이’로 전격 스카우트 됐다!
                    전설적 베테랑 요원 해리 하트(콜린 퍼스)는 경찰서에 구치된 에그시(태런 애거튼)를 구제한다.
                    탁월한 잠재력을 알아본 그는 에그시를 전설적 국제 비밀정보기구 ‘킹스맨’ 면접에 참여시킨다.
                    아버지 또한 ‘킹스맨’의 촉망 받는 요원이었으나 해리 하트를 살리기 위해 죽었다는 사실을 알게 된 에그시.
                    목숨을 앗아갈 만큼 위험천만한 훈련을 통과해야 하는 킹스맨 후보들.
                    최종 멤버 발탁을 눈 앞에 둔 에그시는 최고의 악당 발렌타인(사무엘 L. 잭슨)을 마주하게 되는데…"
                />
                <Movie
                    rank="8"
                    name="미션 임파서블: 로그네이션"
                    image="https://movie-phinf.pstatic.net/20150722_42/1437542046719hBVTi_JPEG/movie_image.jpg"
                    link="https://youtu.be/ndt2hbrGo6A"
                    release="2015.07.30."
                    audience={6126488}
                    tmeter={94} tscore={87}
                    mscore={75} mreview={7.9}
                    boxoffice={682330139}
                    award="15 Golden Tomato Awards Action / Adventure Film"
                    actor="톰 크루즈(에단 헌트), 제레미 레너(윌리엄 브랜트), 사이먼 페그(벤지 던)"
                    story="미국정부로부터 해체 통보를 받게 된 최첨단 첩보기관 IMF(Impossible Mission Force). ‘에단 헌트(톰 크루즈)’를 포함한 팀원들은 모두 뿔뿔이 
                    흩어지게 되고, 정체불명의 테러조직 ‘신디케이트’는 IMF 전멸 작전을 펼친다. 신디케이트에게 납치 당한 ‘에단 헌트’는 의문의 여인 ‘일사(레베카 퍼거슨)’의 
                    도움을 받아 극적 탈출에 성공하고 다시 팀원들을 불러 모은다. 리더 ‘에단 헌트’부터 전략 분석요원 ‘브랜트(제레미 레너)’, IT 전문요원 ‘벤지(사이먼 페그)’, 
                    해킹 전문요원 ‘루터(빙 라메스)’ 그리고 정체를 알 수 없는 ‘일사’까지. 다시 모인 그들은 역대 가장 위협적인 적 
                    신디케이트에 맞서는 불가능한 미션을 펼친다!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="연평해전"
                    image="https://movie-phinf.pstatic.net/20150709_22/1436403002631h77Nm_JPEG/movie_image.jpg"
                    link="https://youtu.be/LPJusF60aoM"
                    release="2015.06.24."
                    audience={6045199}
                    tmeter={0} tscore={71}
                    mscore={0} mreview={0}
                    boxoffice={40034677}
                    award="16휴스턴 국제 영화제 2관왕"
                    actor="김무열(윤영하), 진구(한상국), 이현우(박동혁)"
                    story="해군 출신 아버지의 자랑스러운 아들이자, 참수리 357호 정장 ‘윤영하’ 대위. 아내의 든든한 남편이자, 참수리 357호 조타장 ‘한상국’ 하사.
                    어머니의 하나뿐인 아들이자, 참수리 357호 의무병 ‘박동혁’ 상병.
                    참수리 357호 대원들은 실전을 방불케 하는 고된 훈련 속에 서로를 의지하며 가족 같은 존재가 되어간다.
                    무더운 여름과 함께 월드컵의 함성이 뜨거워지는 가운데, 한국과 터키의 3, 4위전 경기가 열리던 그날
                    서해 바다 한 가운데에 포성이 울리는데…"
                />
                <Movie
                    rank="10"
                    name="쥬라기 월드"
                    image="https://movie-phinf.pstatic.net/20150522_110/14322815808174ge1b_JPEG/movie_image.jpg"
                    link="https://youtu.be/JPZ1x4Bw5js"
                    release="2015.06.11."
                    audience={5547463}
                    tmeter={71} tscore={78}
                    mscore={59} mreview={6.8}
                    boxoffice={1670516444}
                    award="역대 박스오피스 6위"
                    actor="크리스 프랫(오웬 그레디), 브라이스 달라스 하워드(클레어 디어링)"
                    story="‘쥬라기 공원’이 문을 닫은 지 22년, 유전자 조작으로 탄생한 공룡들을 앞세운 ‘쥬라기 월드’는 지상 최대의 테마파크로 자리잡는다.
                    하지만 새롭게 태어난 하이브리드 공룡들은 지능과 공격성을 끝없이 진화시키며
                    인간의 통제를 벗어나기 시작하는데…"
                />
            </div>
        </div>
    );
}
export default List2015;