import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2017() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="부산행 🥇"
                    image="https://movie-phinf.pstatic.net/20200612_248/1591937633750Vvyr6_JPEG/movie_image.jpg"
                    link="https://youtu.be/UOTOjA0ngmk"
                    release="2016.07.20."
                    audience={11572066}
                    tmeter={94} tscore={89}
                    mscore={72} mreview={7.9}
                    boxoffice={129228466}
                    award="시체스, 판타지아 영화제 각 2관왕 , 외 10관왕"
                    actor="공유(석우), 정유미(성경), 마동석(상화)"
                    story="정체불명의 바이러스가 전국으로 확산되고 대한민국 긴급재난경보령이 선포된 가운데, 열차에 몸을 실은 사람들은 단 하나의 안전한 도시 부산까지
                    살아가기 위한 치열한 사투를 벌이게 된다. 서울에서 부산까지의 거리 442KM 지키고 싶은, 지켜야만 하는 사람들의 극한의 사투!"
                />
                <Movie
                    rank="2"
                    name="검사외전 🥈"
                    image="https://movie-phinf.pstatic.net/20160112_146/1452573577623EyUOh_JPEG/movie_image.jpg"
                    link="https://youtu.be/f9eCW428V3A"
                    release="2016.02.03."
                    audience={9707119}
                    tmeter={0} tscore={67}
                    mscore={0} mreview={0}
                    boxoffice={66736633}
                    award="16 Scene Stealer Festival 여우신인상"
                    actor="황정민(변재욱), 강동원(한치원)"
                    story="거친 수사 방식으로 유명한 다혈질 검사 ‘변재욱’(황정민). 취조 중이던 피의자가 변사체로 발견 되면서 살인 혐의로 체포된다.
                    꼼짝없이 살인 누명을 쓰게 된 '변재욱'은 결국 15년 형을 받고 수감 된다. 감옥에서 복수의 칼을 갈던 재욱.
                    5년 후, 자신이 누명을 쓰게 된 사건에 대해 알고 있는 허세남발 꽃미남 사기꾼 ‘치원’(강동원)을
                    우연히 만나게 되고, 그 순간 감옥 밖 작전을 대행해 줄 선수임을 직감한다.
                    검사 노하우를 총 동원, 치원을 무혐의로 내보내고 반격을 준비하는 재욱.
                    하지만 자유를 얻은 치원은 재욱에게서 벗어날 기회만 호시탐탐 노리는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="캡틴 아메리카 : 시빌 워 🥉"
                    image="https://movie-phinf.pstatic.net/20160427_273/1461725031863moaJw_JPEG/movie_image.jpg"
                    link="https://youtu.be/ehOCWue0Ww0"
                    release="2016.04.27."
                    audience={8678117}
                    tmeter={90} tscore={89}
                    mscore={75} mreview={8.3}
                    boxoffice={1153337496}
                    award="2016 세계 TOP 1"
                    actor="크리스 에반스(캡틴 아메리카), 로버트 다우니 주니어(아이언맨), 스칼릿 조핸슨(블랙위도우)"
                    story="어벤져스와 관련된 사고로 부수적인 피해가 일어나자 정부는 어벤져스를 관리하고 감독하는 시스템인 일명 ‘슈퍼히어로 등록제’를 내놓는다.
                    어벤져스 내부는 정부의 입장을 지지하는 찬성파(팀 아이언맨)와 이전처럼 정부의 개입 없이
                    자유롭게 인류를 보호해야 한다는 반대파(팀 캡틴)로 나뉘어 대립하기 시작하는데..."
                />
                <Movie
                    rank="4"
                    name="밀정"
                    image="https://movie-phinf.pstatic.net/20160823_114/1471936485192cjjcD_JPEG/movie_image.jpg"
                    link="https://youtu.be/bVXhxAdytfI"
                    release="2016.09.07."
                    audience={7500457}
                    tmeter={100} tscore={83}
                    mscore={78} mreview={7.0}
                    boxoffice={54491162}
                    award="16대종상영화제 남우조연상"
                    actor="송강호(이정출), 공유(김우진)"
                    story="1920년대 일제강점기. 조선인 출신 일본경찰 이정출(송강호)은 무장독립운동 단체 의열단의 뒤를 캐라는 특명으로
                    의열단의 리더 김우진(공유)에게 접근하고, 한 시대의 양 극단에 서 있는 두 사람은 서로의 정체와 의도를 알면서도 속내를 감춘 채 가까워진다.
                    출처를 알 수 없는 정보가 쌍방간에 새어나가고 누가 밀정인지 알 수 없는 가운데, 의열단은 일제의 주요 시설을 파괴할 폭탄을 경성으로 들여오기 위해,
                    그리고 일본 경찰은 그들을 쫓아 모두 상해에 모인다. 잡아야만 하는 자들과 잡힐 수 없는 자들 사이,
                    자신의 목표를 위해 서로를 이용하려는 암투와 회유, 교란 작전이 숨가쁘게 펼쳐지는 긴장감 속에서
                    폭탄을 실은 열차는 국경을 넘어 경성으로 향하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="마스터"
                    image="https://movie-phinf.pstatic.net/20161221_195/1482293911661KoeOc_JPEG/movie_image.jpg"
                    link="https://youtu.be/IDL-hyjxxM0"
                    release="2016.12.21."
                    audience={7147924}
                    tmeter={75} tscore={52}
                    mscore={53} mreview={0}
                    boxoffice={51636415}
                    award="2020 국산 TOP 5"
                    actor="이병헌(진회장), 강동원(김재명), 김우빈(박장군)"
                    story="화려한 언변, 사람을 현혹하는 재능, 정관계를 넘나드는 인맥으로 수만 명 회원들에게 사기를 치며 승승장구해 온 원네트워크 ‘진회장’(이병헌).
                    반년간 그를 추적해 온 지능범죄수사팀장 ‘김재명’(강동원)은 진회장의 최측근인 ‘박장군’(김우빈)을 압박한다.
                    원네트워크 전산실 위치와 진회장의 로비 장부를 넘기라는 것. 뛰어난 프로그래밍 실력과 명석한 두뇌로 원네트워크를 키워 온 브레인 박장군은
                    계획에 차질이 생긴 것을 감지하자 빠르게 머리를 굴리기 시작한다. 진회장은 물론 그의 뒤에 숨은 권력까지 모조리 잡기 위해 포위망을 좁혀가는 재명,
                    오히려 이 기회를 틈타 돈도 챙기고 경찰의 압박에서도 벗어날 계획을 세우는 장군. 하지만 진회장은 간부 중에 배신자가 있음을 눈치채고, 새로운 플랜을 가동하는데…"
                />
                <Movie
                    rank="6"
                    name="터널"
                    image="https://movie-phinf.pstatic.net/20160801_255/1470026857430Xg6aK_JPEG/movie_image.jpg"
                    link="https://youtu.be/3JdVv5up-Ww"
                    release="2016.08.10."
                    audience={7120780}
                    tmeter={100} tscore={82}
                    mscore={0} mreview={0}
                    boxoffice={52444295}
                    award="17춘시국제영화제 남우주연상"
                    actor="하정우(정수), 배두나(세현), 오달수(대경)"
                    story="자동차 영업대리점의 과장 정수(하정우), 큰 계약 건을 앞두고 들뜬 기분으로 집으로 가던 중
                    갑자기 무너져 내린 터널 안에 홀로 갇히고 만다. 눈에 보이는 것은 거대한 콘크리트 잔해뿐.
                    그가 가진 것은 78% 남은 배터리의 휴대폰과 생수 두 병, 그리고 딸의 생일 케이크가 전부다.
                    구조대는 오늘도 터널 안으로 들어오지 못했다. 대형 터널 붕괴 사고 소식에 대한민국이 들썩이고 정부는 긴급하게 사고 대책반을 꾸린다.
                    사고 대책반의 구조대장 대경(오달수)은 꽉 막혀버린 터널에 진입하기 위해 여러 가지 시도를 해보지만 구조는 더디게만 진행된다.
                    한편, 정수의 아내 세현(배두나)은 정수가 유일하게 들을 수 있는 라디오를 통해 남편에게 희망을 전하며 그의 무사생환에 대한 희망을 버리지 않는다.
                    지지부진한 구조 작업은 결국 인근 제2터널 완공에 큰 차질을 주게 되고, 정수의 생존과 구조를 두고 여론이 분열되기 시작한다."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="인천상륙작전"
                    image="https://movie-phinf.pstatic.net/20160715_16/1468568203431zYbBs_JPEG/movie_image.jpg"
                    link="https://youtu.be/cjtjiKa9uO4"
                    release="2016.07.27."
                    audience={7051237}
                    tmeter={40} tscore={51}
                    mscore={50} mreview={4.7}
                    boxoffice={45641607}
                    award="16대종상영화제 2관왕"
                    actor="이정재(장학수), 이범수(림계진), 리암 니슨(맥아더 장군)"
                    story="1950년 6월 25일 북한의 기습 남침으로 불과 사흘 만에 서울 함락, 한 달 만에 낙동강 지역을 제외한 한반도 전 지역을 빼앗기게 된 대한민국.
                    국제연합군 최고사령관 ‘더글라스 맥아더’(리암 니슨)는 모두의 반대 속 인천상륙작전을 계획한다. 성공확률 5000:1, 불가능에 가까운 작전.
                    이를 가능케 하는 것은 단 하나, 인천으로 가는 길이 확보되어야 하는 것뿐이다. 맥아더의 지시로 대북 첩보작전 ‘X-RAY’에 투입된 해군 첩보부대 대위 ‘장학수’(이정재)는
                    북한군으로 위장 잠입해 인천 내 동태를 살피며 정보를 수집하기 시작한다. 하지만 인천 방어사령관 ‘림계진’(이범수)에 의해 정체가 발각되는 위기에 놓인 가운데
                    ‘장학수’와 그의 부대원들은 전세를 바꿀 단 한번의 기회, 단 하루의 작전을 위해 인천상륙 함대를 유도하는 위험천만한 임무에 나서는데..."
                />
                <Movie
                    rank="8"
                    name="럭키"
                    image="https://movie-phinf.pstatic.net/20160920_197/1474334630845OPmlV_JPEG/movie_image.jpg"
                    link="https://youtu.be/G2zyFe4Z5w0"
                    release="2016.10.13."
                    audience={6975631}
                    tmeter={0} tscore={76}
                    mscore={0} mreview={0}
                    boxoffice={48913975}
                    award="피렌체 한국영화제 관객상"
                    actor="유해진(형욱), 이준(재성), 조윤희(리나)"
                    story="냉혹한 킬러 형욱(유해진)은 사건 처리 후 우연히 들른 목욕탕에서 비누를 밟고 넘어져 과거의 기억을 잃게 된다.
                    인기도, 삶의 의욕도 없어 죽기로 결심한 무명배우 재성(이준)은 신변 정리를 위해 들른 목욕탕에서 그런 형욱을 보게 되고, 
                    자신과 그의 목욕탕 키를 바꿔 도망친다. 이후 형욱은 자신이 재성이라고 생각한 채, 배우로 성공하기 위해 노력하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="곡성"
                    image="https://movie-phinf.pstatic.net/20160425_165/1461560165179gYQ0g_JPEG/movie_image.jpg"
                    link="https://youtu.be/7UVAfhv_FFs"
                    release="2016.05.12."
                    audience={6879989}
                    tmeter={99} tscore={81}
                    mscore={81} mreview={7.9}
                    boxoffice={49851770}
                    award="2016 칸 국제영화제 초청작"
                    actor="곽도원(종구), 황정민(일광), 쿠니무라 준(외지인)"
                    story="낯선 외지인(쿠니무라 준)이 나타난 후 벌어지는 의문의 연쇄 사건들로 마을이 발칵 뒤집힌다. 경찰은 집단 야생 버섯 중독으로 잠정적 결론을 내리지만
                    모든 사건의 원인이 그 외지인 때문이라는 소문과 의심이 걷잡을 수 없이 퍼져 나간다. 경찰 ‘종구’(곽도원)는 현장을 목격했다는 여인 ‘무명’(천우희)을 만나면서
                    외지인에 대한 소문을 확신하기 시작한다. 딸 ‘효진’(김환희)이 피해자들과 비슷한 증상으로 아파오기 시작하자 다급해진 ‘종구’.
                    외지인을 찾아 난동을 부리고, 무속인 ‘일광’(황정민)을 불러들이는데..."
                />
                <Movie
                    rank="10"
                    name="덕혜옹주"
                    image="https://movie-phinf.pstatic.net/20160805_159/1470378561223pYzbp_JPEG/movie_image.jpg"
                    link="https://youtu.be/3u9PuvlMKmo"
                    release="2016.08.03."
                    audience={5599995}
                    tmeter={0} tscore={70}
                    mscore={0} mreview={0}
                    boxoffice={36768213}
                    award="16대종상영화제,백상 여우주연상"
                    actor="손예진(덕혜옹주), 박해일(김장한)"
                    story="일제는 만 13세의 어린 덕혜옹주를 강제 일본 유학길에 오르게 한다. 매일같이 고국 땅을 그리워하며 살아가던 덕혜옹주 앞에
                    어린 시절 친구로 지냈던 장한(박해일)이 나타나고, 영친왕 망명작전에 휘말리고 마는데..."
                />
            </div>
        </div>
    );
}
export default List2017;