import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2012() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="도둑들 🥇"
                    image="https://movie-phinf.pstatic.net/20120718_209/1342589585791cltsr_JPEG/movie_image.jpg"
                    link="https://youtu.be/seGzMn5qu2M"
                    release="2012.07.25."
                    audience={12984701}
                    tmeter={67} tscore={70}
                    mscore={75} mreview={7.1}
                    boxoffice={87129910}
                    award="12청룡영화상 한국영화 최다관객상"
                    actor="김윤석(마카오박), 김혜수(팹시), 이정재(뽀빠이)"
                    story="한 팀으로 활동 중인 한국의 도둑 뽀빠이와 예니콜, 씹던껌, 잠파노. 미술관을 터는데 멋지게 성공한 이들은 뽀빠이의 과거 파트너였던 마카오박이 제안한 
                    홍콩에서의 새로운 계획을 듣게 된다. 여기에 마카오박이 초대하지 않은 손님, 감옥에서 막 출소한 금고털이 팹시가 합류하고 5명은 각자 인생 최고의 반전을 꿈꾸며 
                    홍콩으로 향한다. 홍콩에서 한국 도둑들을 기다리고 있는 4인조 중국도둑 첸, 앤드류, 쥴리, 조니. 최고의 전문가들이 세팅된 가운데 서로에 대한 경계를 늦추지 않는 
                    한국과 중국의 도둑들. 팽팽히 흐르는 긴장감 속에 나타난 마카오박은 자신이 계획한 목표물을 밝힌다. 그것은 마카오 카지노에 숨겨진 희대의 다이아몬드 <태양의 눈물>.
                    성공을 장담할 수 없는 위험천만한 계획이지만 2천만 달러의 달콤한 제안을 거부할 수 없는 이들은 태양의 눈물을 훔치기 위한 작업에 착수한다.
                    그러나 진짜 의도를 알 수 없는 비밀스런 마카오박과 그런 마카오박의 뒤통수를 노리는 뽀빠이, 마카오박에게 배신당한 과거의 기억을 잊지 못하는 팹시와 팀보다 
                    눈 앞의 현찰을 먼저 챙기는 예니콜, 그리고 한국 도둑들을 믿지 않는 첸과 중국 도둑들까지. 훔치기 위해 모였지만 목적은 서로 다른 10인의 도둑들은 서서히 
                    자신만의 플랜을 세우기 시작하는데…"
                />
                <Movie
                    rank="2"
                    name="광해, 왕이 된 남자 🥈"
                    image="https://movie-phinf.pstatic.net/20121018_114/13505269047497LGt6_JPEG/movie_image.jpg"
                    link="https://youtu.be/E-LkaQgj0qM"
                    release="2012.09.13."
                    audience={12324062}
                    tmeter={100} tscore={89}
                    mscore={0} mreview={7.3}
                    boxoffice={94268432}
                    award="12대종상영화제 15관왕"
                    actor="이병헌(광해/하선), 류승룡(허균), 한효주(중전)"
                    story="왕위를 둘러싼 권력 다툼과 붕당정치로 혼란이 극에 달한 광해군 8년. 자신의 목숨을 노리는 자들에 대한 분노와 두려움으로 점점 난폭해져 가던 왕 ‘광해’는 
                    도승지 ‘허균’에게 자신을 대신하여 위협에 노출될 대역을 찾을 것을 지시한다. 이에 허균은 기방의 취객들 사이에 걸쭉한 만담으로 인기를 끌던 하선을 발견한다. 
                    왕과 똑같은 외모는 물론 타고난 재주와 말솜씨로 왕의 흉내도 완벽하게 내는 하선. 영문도 모른 채 궁에 끌려간 하선은 광해군이 자리를 비운 하룻밤 가슴 조이며 
                    왕의 대역을 하게 된다. 그러던 어느 날 광해군이 갑자기 의식을 잃고 쓰러지는 엄청난 사건이 발생하고, 허균은 광해군이 치료를 받는 동안 하선에게 광해군을 
                    대신하여 왕의 대역을 할 것을 명한다. 저잣거리의 한낱 만담꾼에서 하루아침에 조선의 왕이 되어버린 천민 하선. 허균의 지시 하에 말투부터 걸음걸이, 국정을 다스리는 
                    법까지, 함부로 입을 놀려서도 들켜서도 안 되는 위험천만한 왕노릇을 시작한다. 하지만 예민하고 난폭했던 광해와는 달리 따뜻함과 인간미가 느껴지는 달라진 왕의 모습에
                    궁정이 조금씩 술렁이고, 점점 왕의 대역이 아닌 자신의 목소리를 내기 시작하는 
                    하선의 모습에 허균도 당황하기 시작하는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="어벤져스 🥉"
                    image="https://movie-phinf.pstatic.net/20120426_172/1335428116411i030K_JPEG/movie_image.jpg"
                    link="https://youtu.be/bGt-saFvkNk"
                    release="2012.04.26."
                    audience={7087068}
                    tmeter={91} tscore={91}
                    mscore={69} mreview={8.0}
                    boxoffice={1518815515}
                    award="2012 세계 TOP 1"
                    actor="로버트 다우니 주니어(토니 스타크/아이언맨), 스칼릿 조핸슨(나타샤 로마노프/블랙 위도우)"
                    story="지구의 안보가 위협당하는 위기의 상황에서 슈퍼히어로들을 불러모아 세상을 구하는, 일명 [어벤져스] 작전.
                    에너지원 ‘큐브’를 이용한 적의 등장으로 인류가 위험에 처하자 국제평화유지기구인 쉴드 (S.H.I.E.L.D)의 국장 닉 퓨리(사무엘 L.잭슨)는 [어벤져스] 작전을 위해 
                    전 세계에 흩어져 있던 슈퍼히어로들을 찾아나선다. 아이언맨(로버트 다우니 주니어)부터 토르(크리스 헴스워스), 헐크(마크 러팔로), 캡틴 아메리카(크리스 에반스)는 
                    물론, 쉴드의 요원인 블랙 위도우(스칼렛 요한슨), 호크 아이(제레미 레너)까지, 최고의 슈퍼히어로들이 [어벤져스]의 멤버로 모이게 되지만, 각기 개성이 강한 이들의 
                    만남은 예상치 못한 방향으로 흘러가는데…"
                />
                <Movie
                    rank="4"
                    name="늑대소년"
                    image="https://movie-phinf.pstatic.net/20121015_190/1350280084768nSVfX_JPEG/movie_image.jpg"
                    link="https://youtu.be/qM3ODWcXaBk"
                    release="2012.10.31."
                    audience={7069579}
                    tmeter={100} tscore={85}
                    mscore={0} mreview={0}
                    boxoffice={46282588}
                    award="13대종상, 부일영화상 여우조연상"
                    actor="송중기(늑대소년), 박보영(순이)"
                    story="요양 차 가족들과 한적한 마을로 이사 간 소녀는 어둠 속에 몸을 숨긴 의문의 늑대소년을 발견한다. 야생의 눈빛으로 사람 같지 않은 행동을 보이는 소년에게 
                    왠지 마음이 쓰이는 소녀는 먹을 것을 보고 기다리는 법, 옷 입는 법, 글을 읽고 쓰는 법 등 소년에게 세상에서 살아가는 방법들을 하나씩 가르쳐준다. 태어나 처음으로 
                    자신을 향해 손을 내밀어준 소녀에게 애틋한 감정이 싹트는 소년.  그러던 어느 날 예기치 못한 위기 속에 소년의 숨겨져 있던 위험한 본성이 드러나고, 소년은 순식간에 
                    마을 사람들에게 두려움과 공포의 대상이 되어버리는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="다크 나이트 라이즈"
                    image="https://movie-phinf.pstatic.net/20200622_61/1592788752680j06Sn_JPEG/movie_image.jpg"
                    link="https://youtu.be/J9DlV9qwtF0"
                    release="2012.07.19."
                    audience={6428574}
                    tmeter={87} tscore={90}
                    mscore={78} mreview={8.8}
                    boxoffice={1081041287}
                    award="2012 세계 TOP 3"
                    actor="크리스찬 베일(브루스 웨인/배트맨), 마이클 케인(알프레드), 게리 올드만(짐 고든)"
                    story="배트맨이 조커와의 대결을 끝으로 세상에서 모습을 감춘 8년 후, 하비 덴트의 죽음에 대한 책임을 떠안은 배트맨은 모든 것을 희생하며 떠나고..
                    범죄방지 덴트법으로 인해 한동안 평화가 지속되던 고담시의 파멸을 예고하며 나타난 마스크를 쓴 잔인한 악당, 최강의 적 베인이 등장한다.
                    베인은 배트맨이 스스로 택한 유배 생활에 종지부를 찍게 하지만, 다시 돌아온 배트맨에게 베인은 만만한 상대가 아니다.
                    자신을 거부한 사람들의 고통을 지켜볼 것인가, 정의의 수호자로 나설 것인가.
                    배트맨은 승패를 알 수 없는 마지막 전투를 시작하려 하는데…"
                />
                <Movie
                    rank="6"
                    name="레미제라블"
                    image="https://movie-phinf.pstatic.net/20130114_290/1358128162403GMaQx_JPEG/movie_image.jpg"
                    link="https://youtu.be/1q82twrdr0U"
                    release="2012.12.19."
                    audience={5938769}
                    tmeter={70} tscore={79}
                    mscore={63} mreview={7.4}
                    boxoffice={441809770}
                    award="13아카데미 3관왕"
                    actor="휴 잭맨(장발장), 앤 해서웨이(판틴), 러셀 크로우(자베르)"
                    story="빵 한 조각을 훔친 죄로 19년의 감옥살이를 한 장발장(휴 잭맨). 전과자라는 이유만으로 모두의 박해를 받던 장발장은 우연히 만난 신부의 손길 아래 구원을 받고
                    새로운 삶을 결심한다. 정체를 숨기고 마들렌이라는 새 이름으로 가난한 이들을 도우며 지내던 장발장은 운명의 여인, 판틴(앤 해서웨이)과 마주치고, 죽음을 눈앞에 둔 
                    판틴은 자신의 유일한 희망인 딸, 코제트(아만다 사이프리드)를 장발장에게 부탁한다. 그러나 코제트를 만나기도 전에 경감 자베르(러셀 크로우)는 장발장의 진짜 정체를 
                    알아차리고, 오래된 누명으로 다시 체포된 장발장은 코제트를 찾아 탈옥을 감행하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="타워"
                    image="https://movie-phinf.pstatic.net/20121206_104/1354758498530WnR2g_JPEG/movie_image.jpg"
                    link="https://youtu.be/Fw1EEbbDVok"
                    release="2012.12.25."
                    audience={5181228}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={36531605}
                    award="13대종상영화제 기술상"
                    actor="설경구(강영기), 손예진(서윤희), 김상경(이대호)"
                    story="초고층 주상복합빌딩 타워스카이의 시설관리 팀장인 싱글대디 ‘대호’(김상경)는 사랑하는 딸 ‘하나’(조민아)와 함께 멋진 크리스마스 이브를 보내기로 약속한다. 
                    대호가 마음에 품고 있는 타워스카이 푸드몰의 매니저 ‘윤희’(손예진)는 바쁜 ‘대호’를 대신해 잠시나마 ‘하나’와 즐거운 시간을 보낸다.
                    한편, 전설로 불리우는 여의도 소방서의 소방대장 ‘영기’(설경구)는 결혼 후 처음으로 크리스마스 이브에 아내와의 데이트를 약속한다.모두가 행복한 그 날 저녁, 
                    크리스마스 파티가 열리고 있는 타워스카이에서 예기치 못한 화재 사고가 발생하는데…"
                />
                <Movie
                    rank="8"
                    name="바람과 함께 사라지다"
                    image="https://movie-phinf.pstatic.net/20120731_293/1343700608641aFsBs_JPEG/movie_image.jpg"
                    link="https://youtu.be/F5vnG0GKMeg"
                    release="2012.08.08."
                    audience={4909944}
                    tmeter={0} tscore={54}
                    mscore={0} mreview={0}
                    boxoffice={30158762}
                    award="13 Fantasporto 국제영화제 작품상"
                    actor="차태현(이덕무), 오지호(백동수), 민효린(백수련)"
                    story="총명함은 타고났으나 우의정의 서자요, 잡서적에 빠져 지내던 ‘덕무(차태현)’. 얼음 독점권을 차지하려는 좌의정 ‘조명수’에 의해 아버지가 누명을 쓰게 되자 
                    그의 뒤통수를 칠 묘안을 떠올린다. 바로 서빙고의 얼음을 통째로 털겠다는 것! 한때 서빙고를 관리했지만 조명수 일행에 의해 파직당한 ‘동수(오지호)’와 손을 잡은 
                    덕무는 작전에 필요한 조선 제일의 고수들을 찾아 나선다. 한양 최고의 돈줄 ‘수균(성동일)’을 물주로 잡고, 도굴 전문가 ‘석창(고창석)’, 폭탄 제조 전문가 
                    ‘대현(신정근)’, 변장술의 달인 ‘재준(송종호)’, 총알배송 마차꾼 ‘철주(김길동)’ 등 각 분야 전문가들을 불러모은 덕무와 동수. 여기에 동수의 여동생인 잠수전문가 
                    ‘수련(민효린)’과 아이디어 뱅크 ‘정군(천보근)’, 유언비어의 원조 ‘난이(김향기)’까지 조선 최고의 ‘꾼’들이 모두 한자리에 모이게 되고, 3만정의 얼음을 훔치기 위한 
                    본격 작전에 나서기 시작한다!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="어메이징 스파이더맨"
                    image="https://movie-phinf.pstatic.net/20120613_242/1339557337381G94zJ_JPEG/movie_image.jpg"
                    link="https://youtu.be/y0VTJPTI_u8"
                    release="2012.06.28."
                    audience={4853273}
                    tmeter={72} tscore={77}
                    mscore={66} mreview={7.0}
                    boxoffice={757930663}
                    award="2012 세계 TOP 7"
                    actor="앤드류 가필드(피터 파커/스파이더맨), 엠마 스톤(그웬 스테이시)"
                    story="어릴적 사라진 부모 대신 삼촌 내외와 살고 있는 피터 파커(앤드류 가필드)는 여느 고등학생처럼 평범한 학교 생활을 하며 일상을 보내고, 같은 학교 학생 
                    그웬 스테이시(엠마 스톤)와 첫사랑에 빠져 우정과 사랑, 그리고 둘 만의 비밀을 키워나간다. 그러던 어느 날 아버지가 사용했던 비밀스러운 가방을 발견하고 부모님의 
                    실종사건에 대한 의심을 품게 된 그는 그 동안 숨겨져 왔던 과거의 비밀을 추적하게 된다. 아버지의 옛 동료 코너스 박사(리스 이판)의 실험실을 찾아가게 된 피터는 
                    우연한 사고로 특별한 능력을 갖게 되고, 뜻밖의 피터의 도움으로 연구를 완성한 코너스 박사는 자신의 숨겨진 자아인 악당 ‘리자드’를 탄생시킨다. 세상을 위협하는 
                    세력앞에 피터는 그의 인생을 통째로 바꾸어 버릴 일생일대의 선택, 
                    바로 ‘스파이더맨’이라 불리우는 영웅이 되기로 결심하는데…"
                />
                <Movie
                    rank="10"
                    name="범죄와의 전쟁: 나쁜놈들 전성시대"
                    image="https://movie-phinf.pstatic.net/20111224_165/13246577572754h14b_JPEG/movie_image.jpg"
                    link="https://youtu.be/zPRFKk3gYBE"
                    release="2012.02.02."
                    audience={4720172}
                    tmeter={100} tscore={74}
                    mscore={0} mreview={0}
                    boxoffice={32472645}
                    award="12청룡영화상 3관왕"
                    actor="최민식(최익현), 하정우(최형배)"
                    story="1982년 부산. 해고될 위기에 처한 비리 세관원 최익현(최민식)은 순찰 중 적발한 히로뽕을 일본으로 밀수출, 마지막으로 한 탕 하기 위해 부산 최대 조직의 
                    젊은 보스 최형배(하정우)와 손을 잡는다.익현은 탁월한 임기응변과 특유의 친화력으로 형배의 신뢰를 얻는 데 성공한다. 주먹 넘버원 형배와 로비의 신 익현은 
                    함께 힘을 합쳐 부산을 접수하기 시작하고, 두 남자 앞에 나쁜 놈들의 전성시대가 펼쳐진다.하지만 1990년 범죄와의 전쟁이 선포되자 조직의 의리는 금이 가고 
                    넘버원이 되고 싶은 나쁜 놈들 사이의 배신이 시작된다. 살아남기 위해 벌이는 치열한 한판 승부, 
                    최후에 웃는 자는 과연 누가 될 것인가?"
                />
            </div>
        </div>
    );
}
export default List2012;