import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2013() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="7번방의 선물 🥇"
                    image="https://movie-phinf.pstatic.net/20130118_115/1358472020816kP4vN_JPEG/movie_image.jpg"
                    link="https://youtu.be/rvcN5uFf_VI"
                    release="2013.01.23."
                    audience={12812144}
                    tmeter={0} tscore={90}
                    mscore={0} mreview={0}
                    boxoffice={82101723}
                    award="13대종상영화제 4관왕"
                    actor="류승룡(용구), 갈소원(어린 예승), 박신혜(큰 예승)"
                    story="최악의 흉악범들이 모인 교도소 7번방에 이상한 놈이 들어왔다! 그는 바로 6살 지능의 딸바보 '용구'!
                    평생 죄만 짓고 살아온 7번방 패밀리들에게 떨어진 미션은 바로 '용구' 딸 '예승'이를 외부인 절대 출입금지인 교도소에 반.입.하.는.것!
                    2013년 새해, 웃음과 감동 가득한 사상초유의 합동작전이 시작된다!"
                />
                <Movie
                    rank="2"
                    name="변호인 🥈"
                    image="https://movie-phinf.pstatic.net/20131203_145/1386034788519v2Vwy_JPEG/movie_image.jpg"
                    link="https://youtu.be/3UWwRykamZw"
                    release="2013.12.18."
                    audience={11375123}
                    tmeter={75} tscore={87}
                    mscore={55} mreview={0}
                    boxoffice={78547586}
                    award="2014년 통산 32관왕"
                    actor="송강호(송우석), 김영애(최순애), 오달수(박동호)"
                    story="1980년대 초 부산. 빽 없고, 돈 없고, 가방끈도 짧은 세무 변호사 송우석(송강호). 부동산 등기부터 세금 자문까지 남들이 뭐라든 탁월한 사업수완으로 승승장구하며 부산에서 제일 잘나가고 돈 잘 버는 변호사로 이름을 날린다.
                    대기업의 스카우트 제의까지 받으며 전국구 변호사 데뷔를 코 앞에 둔 송변. 하지만 우연히 7년 전 밥값 신세를 지며 정을 쌓은 국밥집 아들 진우(임시완)가 뜻하지 않은 사건에 휘말려 재판을 앞두고 있다는 소식을 듣는다. 국밥집 아줌마 순애(김영애)의 간절한 부탁을 외면할 수 없어 구치소 면회만이라도 도와주겠다고 나선 송변.
                    하지만 그곳에서 마주한 진우의 믿지 못할 모습에 충격을 받은 송변은 모두가 회피하기 바빴던 사건의 변호를 맡기로 결심하는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="설국열차 🥉"
                    image="https://movie-phinf.pstatic.net/20130610_131/1370829667952NUsHp_JPEG/movie_image.jpg"
                    link="https://youtu.be/mmiGsmbu3mQ"
                    release="2013.08.01."
                    audience={9353799}
                    tmeter={94} tscore={72}
                    mscore={84} mreview={7.2}
                    boxoffice={86758912}
                    award="13청룡, 14백상예술대상 감독상"
                    actor="크리스 에반스(커티스), 송강호(남궁민수), 에드 해리스(윌포드)"
                    story="기상 이변으로 모든 것이 꽁꽁 얼어붙은 지구. 살아남은 사람들을 태운 기차 한 대가 끝없이 궤도를 달리고 있다. 
                    춥고 배고픈 사람들이 바글대는 빈민굴 같은 맨 뒤쪽의 꼬리칸, 그리고 선택된 사람들이 술과 마약까지 즐기며 호화로운 객실을 뒹굴고 있는 앞쪽칸. 
                    열차 안의 세상은 결코 평등하지 않다. 기차가 달리기 시작한 17년 째, 꼬리칸의 젊은 지도자 커티스는 긴 세월 준비해 온 폭동을 일으킨다. 
                    기차의 심장인 엔진을 장악, 꼬리칸을 해방시키고 마침내 기차 전체를 해방 시키기 위해 절대권력자 윌포드가 도사리고 있는 맨 앞쪽 엔진칸을 향해 
                    질주하는 커티스와 꼬리칸 사람들. 그들 앞에 예기치 못한 상황들이 기다리고 있는데…"
                />
                <Movie
                    rank="4"
                    name="관상"
                    image="https://movie-phinf.pstatic.net/20130819_110/1376895907326wlXma_JPEG/movie_image.jpg"
                    link="https://youtu.be/nJTa6JkrIjQ"
                    release="2013.09.11."
                    audience={9135806}
                    tmeter={0} tscore={74}
                    mscore={0} mreview={0}
                    boxoffice={61559184}
                    award="13대종상영화제 6관왕"
                    actor="송강호(내경), 이정재(수양대군), 백윤식(김종서)"
                    story="얼굴을 보면 그 사람의 모든 것을 꿰뚫어보는 천재 관상가 내경. 처남 ‘팽헌’, 아들 ‘진형’과 산속에 칩거하고 있던 그는 
                    관상 보는 기생 ‘연홍’의 제안으로 한양으로 향하고, 연홍의 기방에서 사람들의 관상을 봐주는 일을 하게 된다. 용한 관상쟁이로 한양 바닥에 소문이 돌던 무렵, 
                    ‘내경’은 ‘김종서’로부터 사헌부를 도와 인재를 등용하라는 명을 받아 궁으로 들어가게 되고, ‘수양대군’이 역모를 꾀하고 있음을 알게 된 그는 위태로운 
                    조선의 운명을 바꾸려 한다."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="아이언맨3"
                    image="https://movie-phinf.pstatic.net/20130311_165/13629835475487aDfz_JPEG/movie_image.jpg"
                    link="https://youtu.be/oYSD2VQagc4"
                    release="2013.04.25."
                    audience={9001679}
                    tmeter={79} tscore={78}
                    mscore={62} mreview={6.5}
                    boxoffice={1214811252}
                    award="2013 세계 TOP 2 / 시리즈 1700만"
                    actor="로버트 다우니 주니어(토니 스타크/아이언맨), 기네스 팰트로(페퍼 포츠)"
                    story="<어벤져스> 뉴욕 사건의 트라우마로 인해 영웅으로서의 삶에 회의를 느끼는 토니 스타크(로버트 다우니 주니어). 그가 혼란을 겪는 사이 
                    최악의 테러리스트 만다린(벤 킹슬리)을 내세운 익스트리미스 집단 AIM이 스타크 저택에 공격을 퍼붓는다. 이 공격으로 그에게 남은 건 망가진 수트 한벌 뿐.
                    모든 것을 잃어버린 그는 다시 테러의 위험으로부터 세계와 사랑하는 여인(기네스 팰트로)를 지켜내야 하는 동시에 머릿속을 떠나지 않던 한가지 물음의 해답도 
                    찾아야만 한다. 과연 그가 아이언맨인가? 수트가 아이언맨인가?"
                />
                <Movie
                    rank="6"
                    name="베를린"
                    image="https://movie-phinf.pstatic.net/20130128_162/1359336144110Ko1W2_JPEG/movie_image.jpg"
                    link="https://youtu.be/8tUQ4fblukM"
                    release="2013.01.30."
                    audience={7166688}
                    tmeter={0} tscore={0}
                    mscore={54} mreview={5.0}
                    boxoffice={48979656}
                    award="13대종상, 청룡영화상 각 2관왕"
                    actor="하정우(표종성), 한석규(정진수), 류승범(동명수)"
                    story="거대한 국제적 음모가 숨겨진 운명의 도시 베를린.
                    그 곳에 상주하는 국정원 요원 정진수는 불법무기거래장소를 감찰하던 중 국적불명, 지문마저 감지되지 않는 일명 ‘고스트’ 비밀요원 표종성의 존재를 알게 된다. 
                    그의 정체를 밝혀내기 위해 뒤를 쫓던 정진수는 그 배후에 숨겨진 엄청난 국제적 음모를 알게 되면서 걷잡을 수 없는 위기에 빠진다.
                    한편 표종성을 제거하고 베를린을 장악하기 위해 파견된 동명수는 그의 아내 연정희를 반역자로 몰아가며 이를 빌미로 숨통을 조이고, 표종성의 모든 것에 위협을 가한다. 
                    표종성은 동명수의 협박 속에서 연정희의 무죄를 증명하기 위해서 그녀를 미행하게 되지만, 
                    예상치 못한 아내의 비밀을 알게 되면서 혼란에 휩싸이게 되는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="은밀하게 위대하게"
                    image="https://movie-phinf.pstatic.net/20130426_136/1366966676054ppCW9_JPEG/movie_image.jpg"
                    link="https://youtu.be/fq8k4SMzRRQ"
                    release="2013.06.05."
                    audience={6959083}
                    tmeter={0} tscore={71}
                    mscore={0} mreview={0}
                    boxoffice={43447199}
                    award="14백상예술대상 남자신인연기상"
                    actor="김수현(원류환), 박기웅(리해랑), 이현우(리해진)"
                    story="공화국에선 혁명전사,이 곳에선 간첩. 들개로 태어나 괴물로 길러진 내 남파임무는 어이없지만 동네 바보입니다.
                    북한의 남파특수공작 5446 부대. 20000:1의 경쟁률을 뚫은 최고 엘리트 요원 원류환, 공화국 최고위층 간부의 아들이자 류환 못지 않은 실력자 리해랑, 
                    공화국 사상 최연소 남파간첩 리해진. 세 사람은 5446부대의 전설 같은 존재이다. 하지만 조국통일이라는 원대한 사명을 안고 남파된 그들이 맡은 임무는 
                    어처구니 없게도 달동네 바보, 가수지망생, 고등학생이다. 전달되는 명령도 없이 시간은 흘러만 가고 남한 최하층 달동네 사람들과 부대끼며 살아가는 일상에 
                    익숙해져 간다. 그러던 어느 날 그들에게 전혀 뜻밖의 은밀하고 위대한 임무가 내려진다."
                />
                <Movie
                    rank="8"
                    name="숨바꼭질"
                    image="https://movie-phinf.pstatic.net/20130716_4/1373955914064wqez6_JPEG/movie_image.jpg"
                    link="https://youtu.be/a5Q2m-3AfOY"
                    release="2013.08.14."
                    audience={5604106}
                    tmeter={0} tscore={63}
                    mscore={0} mreview={0}
                    boxoffice={35461505}
                    award="14황금촬영상 2관왕"
                    actor="손현주(성수), 문정희(주희), 전미선(민지)"
                    story="고급 아파트에서 완벽한 가정을 꾸리고 사는 성공한 사업가 ‘성수’(손현주)는 하나 뿐인 형에 대한 비밀과 지독한 결벽증을 갖고 있다.
                    어느 날 그는 형의 실종 소식을 듣고 수십 년 만에 찾아간 형의 아파트에서 집집마다 새겨진 이상한 암호와 형을 알고 있는 ‘주희’(문정희) 가족을 만난다.
                    어린 딸과 단 둘이 살고 있는 ‘주희’는 자신의 집을 훔쳐보는 누군가의 존재를 느끼며 두려움에 떨고 있다.
                    낡은 아파트의 암호를 찬찬히 살펴보던 ‘성수’는 그것이 그 집에 사는 사람의 성별과 수를 뜻하는 것을 알게 된다.
                    형의 아파트를 뒤로한 채 자신의 안락한 집으로 돌아온 그 날, ‘성수’는 형의 아파트에서 봤던 암호가 자신의 집 초인종 옆에서
                    새겨진 것을 발견한다. 사라진 형. 숨바꼭질 암호. 서로 다른 두 가족에게 찾아온 충격적 진실.
                    가족을 지키기 위한 두 가장의 숨가쁜 사투가 시작된다!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="더 테러 라이브"
                    image="https://movie-phinf.pstatic.net/20130722_208/1374462076401seeEk_JPEG/movie_image.jpg"
                    link="https://youtu.be/mcciB7YssDM"
                    release="2013.07.31."
                    audience={5584295}
                    tmeter={0} tscore={73}
                    mscore={0} mreview={0}
                    boxoffice={35659824}
                    award="14황금촬영상 연기대상"
                    actor="하정우(윤영화), 이경영(차대은), 전혜진(박정민)"
                    story="불미스러운 일로 라디오 프로그램으로 밀려난 국민 앵커 ‘윤영화’는 생방송 진행 중, 신원미상 청취자로부터 협박전화를 받는다.
                    장난전화로 치부하며 전화를 끊은 순간, 마포대교가 폭발하는 장면을 목격하게 된다. 눈 앞에서 벌어진 끔찍한 재난이 ‘테러사건’이라는 단서를 쥐게 된 윤영화!
                    마감뉴스 복귀 조건으로 보도국장과 물밑 거래를 시도한 그는 테러범과의 전화통화를 독점 생중계하기에 이른다.
                    21억이라는 거액의 보상금과 대통령의 사과를 요구하는 테러범. 한편 윤영화는 자신의 귀에 꽂힌 인이어에 폭탄이 설치된 사실을 알게 되는데…
                    테러범의 정체는 무엇이며, 왜 하필 앵커 ‘윤영화’를 지목했을까?"
                />
                <Movie
                    rank="10"
                    name="감시자들"
                    image="https://movie-phinf.pstatic.net/20130625_266/1372151438403vbOHW_JPEG/movie_image.jpg"
                    link="https://youtu.be/AwzLHOQcFC8"
                    release="2013.07.03."
                    audience={5509019}
                    tmeter={0} tscore={72}
                    mscore={0} mreview={0}
                    boxoffice={37795598}
                    award="13청룡, 부일영화상 여우주연상"
                    actor="설경구(황반장), 정우성(제임스), 한효주(하윤주)"
                    story="범죄 대상에 대한 감시만을 전문적으로 담당하는 경찰 내 특수조직 감시반. 동물적인 직감과 본능으로 범죄를 쫓는 감시 전문가 ‘황반장’(설경구)이 이끄는 감시반에
                    탁월한 기억력과 관찰력을 지닌 신참 ‘하윤주’(한효주)가 합류한다. 그리고 얼마 후 감시반의 철저한 포위망마저 무용지물로 만든 범죄가 벌어진다.
                    단 3분만에 한 치의 실수도 없이 벌어진 무장강도사건. 얼굴도, 단서도 남기지 않은 그들의 존재에 모든 시선이 꽂힌다.
                    철저하게 짜여진 계획 하에 움직이며 1초의 오차도 용납하지 않는 범죄 조직의 리더 ‘제임스’(정우성).
                    자신의 존재를 절대 드러내지 않는 그는 감시반의 추적이 조여올수록 더욱 치밀하게 범죄를 이어간다.
                    더 이상의 범죄를 막기 위해 반드시 놈의 실체를 알아내야만 하는 감시반.
                    황반장과 하윤주는 모든 기억과 단서를 동원해 놈을 쫓기 시작하는데..."
                />
            </div>
        </div>
    );
}
export default List2013;