import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2021() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="스파이더맨 : 노 웨이 홈 🥇"
                    image="https://movie-phinf.pstatic.net/20211215_297/1639556766975z0641_JPEG/movie_image.jpg"
                    link="https://youtu.be/W7edvITC9g4"
                    release="2021.12.15."
                    audience={7524693}
                    tmeter={93} tscore={98}
                    mscore={71} mreview={8.9}
                    boxoffice={1835421947}
                    award="2021 세계 TOP 1 / MCU 솔로영화 1위"
                    actor="톰 홀랜드(피터 파커/스파이더맨), 젠데이아 콜먼(MJ), 베네딕트 컴버배치(닥터 스트레인지)"
                    story="‘미스테리오’의 계략으로 세상에 정체가 탄로난 스파이더맨 ‘피터 파커’는 하루 아침에 평범한 일상을 잃게 된다.
                    문제를 해결하기 위해 ‘닥터 스트레인지’를 찾아가 도움을 청하지만 뜻하지 않게 멀티버스가 열리면서 각기 다른 차원의 불청객들이 나타난다.
                    ‘닥터 옥토퍼스’를 비롯해 스파이더맨에게 깊은 원한을 가진 숙적들의 강력한 공격에 ‘피터 파커’는 사상 최악의 위기를 맞게 되는데…"
                />
                <Movie
                    rank="2"
                    name="모가디슈 🥈"
                    image="https://movie-phinf.pstatic.net/20210820_122/1629448997924YXUCv_JPEG/movie_image.jpg"
                    link="https://youtu.be/VOdDMmSjle0"
                    release="2021.07.28."
                    audience={3613981}
                    tmeter={93} tscore={87}
                    mscore={77} mreview={7.2}
                    boxoffice={29855981}
                    award="2021 국산 TOP 1 / 21청룡영화상 최우수 작품상"
                    actor="김윤석(한신성), 조인성(강대진), 허준호(림용수)"
                    story="대한민국이 UN가입을 위해 동분서주하던 시기 1991년 소말리아의 수도 모가디슈에서는 일촉즉발의 내전이 일어난다.
                    통신마저 끊긴 그 곳에 고립된 대한민국 대사관의 직원과 가족들은 총알과 포탄이 빗발치는 가운데, 살아남기 위해 하루하루를 버텨낸다.
                    그러던 어느 날 밤, 북한 대사관의 일행들이 도움을 요청하며 문을 두드리는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="이터널스 🥉"
                    image="https://movie-phinf.pstatic.net/20211026_97/1635213484861yCnwO_JPEG/movie_image.jpg"
                    link="https://youtu.be/BdkSkI61aGo"
                    release="2021.11.03."
                    audience={3050419}
                    tmeter={47} tscore={78}
                    mscore={52} mreview={6.3}
                    boxoffice={402064899}
                    award="2021 세계 TOP 10"
                    actor="안젤리나 졸리(테나), 마동석(길가메시), 리차드 매든(이카리스)"
                    story="마블 스튜디오의 <이터널스>는 수 천년에 걸쳐 그 모습을 드러내지 않고 살아온
                    불멸의 히어로들이 <어벤져스: 엔드게임> 이후 인류의 가장 오래된 적 '데비안츠'에 맞서기 위해 
                    다시 힘을 합치면서 벌어지는 이야기"
                />
                <Movie
                    rank="4"
                    name="블랙 위도우"
                    image="https://movie-phinf.pstatic.net/20210617_272/1623906098516QjpeS_JPEG/movie_image.jpg"
                    link="https://youtu.be/BOEVQSprNv4"
                    release="2021.07.07."
                    audience={2962088}
                    tmeter={79} tscore={91}
                    mscore={67} mreview={6.5}
                    boxoffice={379751655}
                    award="2021 세계 TOP 12"
                    actor="스칼릿 조핸슨(나타샤), 플로렌스 퓨(옐레나), 레이첼 와이즈(멜리나)"
                    story="어벤져스의 히어로 블랙 위도우, ‘나타샤 로마노프’ (스칼렛 요한슨)는 자신의 과거와 연결된 레드룸의 거대한 음모와 실체를 깨닫게 된다.
                    상대의 능력을 복제하는 빌런 ‘태스크마스터’와 새로운 위도우들의 위협에 맞서 목숨을 건 반격을 시작하는 ‘나타샤’는 스파이로 활약했던 자신의 과거 뿐 아니라,
                    어벤져스가 되기 전 함께했던 동료들을 마주해야만 하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="분노의 질주 : 더 얼티메이트"
                    image="https://movie-phinf.pstatic.net/20210421_37/1618971733493B4ykS_JPEG/movie_image.jpg"
                    link="https://youtu.be/L9Y-hn2COm0"
                    release="2021.05.19."
                    audience={2292413}
                    tmeter={59} tscore={82}
                    mscore={58} mreview={4.7}
                    boxoffice={726229501}
                    award="2021 세계 TOP 5"
                    actor="빈 디젤(도미닉 토레토), 존 시나(제이콥 토레토), 성 강(한)"
                    story="도미닉(빈 디젤)은 자신과 가장 가까웠던 형제 제이콥(존 시나)이 사이퍼(샤를리즈 테론)와 연합해
                    전 세계를 위기로 빠트릴 위험천만한 계획을 세운다는 사실을 알게 되고, 이를 막기 위해 다시 한 번 패밀리들을 소환한다.
                    가장 가까운 자가 한순간, 가장 위험한 적이 된 상황 도미닉과 패밀리들은 이에 반격할 놀라운 컴백과 작전을 세우고
                    지상도, 상공도, 국경도 경계가 없는 불가능한 대결이 시작되는데…"
                />
                <Movie
                    rank="6"
                    name="싱크홀"
                    image="https://movie-phinf.pstatic.net/20210726_114/1627265960693kkM0B_JPEG/movie_image.jpg"
                    link="https://youtu.be/EId_z8wrKao"
                    release="2021.08.11."
                    audience={2195683}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={18804231}
                    award="21황금촬영상 남자인기상"
                    actor="차승원(정만수), 김성균(박동원), 이광수(김승현)"
                    story="서울 입성과 함께 내 집 마련의 꿈을 이룬 가장 ‘동원(김성균)’ 이사 첫날부터 프로 참견러 ‘만수’(차승원)와 사사건건 부딪힌다.
                    ‘동원’은 자가취득을 기념하며 직장 동료들을 집들이에 초대하지만 행복한 단꿈도 잠시, 순식간에 빌라 전체가 땅 속으로 떨어지고 만다.
                    마주치기만 하면 투닥거리는 빌라 주민 ‘만수’와 ‘동원’, 집들이에 왔던 ‘김대리’(이광수)와 인턴사원 ‘은주’(김혜준)까지!
                    지하 500m 싱크홀 속으로 떨어진 이들은 과연 무사히 빠져나갈 수 있을까?"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="극장판 귀멸의 칼날 : 무한열차편"
                    image="https://movie-phinf.pstatic.net/20210126_174/1611638248803840HH_JPEG/movie_image.jpg"
                    link="https://tv.naver.com/v/16586480"
                    release="2021.01.27."
                    audience={2151861}
                    tmeter={98} tscore={99}
                    mscore={72} mreview={8.4}
                    boxoffice={503063688}
                    award="21 J . A 최우수 애니작품상 / 2020 세계 TOP 1"
                    actor="하나에 나츠키(카마도 탄지로 목소리), 키토 아카리(카마도 네즈코 목소리)"
                    story="혈귀로 변해버린 여동생 ‘네즈코’를 인간으로 되돌릴 단서를 찾아 비밀조직 귀살대에 들어간 ‘탄지로.’
                    ‘젠이츠’, ‘이노스케’와 새로운 임무 수행을 위해 무한열차에 탑승 후 귀살대 최강 검사 염주 ‘렌고쿠’와 합류한다.
                    달리는 무한열차에서 승객들이 하나 둘 흔적 없이 사라지자 숨어있는 식인 혈귀의 존재를 직감하는 ‘렌고쿠’.
                    귀살대 ‘탄지로’ 일행과 최강 검사 염주 ‘렌고쿠’는 어둠 속을 달리는 무한열차에서 모두의 목숨을 구하기 위해
                    예측불가능한 능력을 가진 혈귀와 목숨을 건 혈전을 시작하는데…"
                />
                <Movie
                    rank="8"
                    name="베놈 2 : 렛 데어 비 카니지"
                    image="https://movie-phinf.pstatic.net/20210929_275/1632903680953494p8_JPEG/movie_image.jpg"
                    link="https://youtu.be/V6aWnlhH6ug"
                    release="2021.10.13."
                    audience={2123652}
                    tmeter={59} tscore={84}
                    mscore={49} mreview={5.8}
                    boxoffice={502050366}
                    award="2021 세계 TOP 7"
                    actor="톰 하디(에디 브록 / 베놈), 미셸 윌리엄스(앤 웨잉)"
                    story="‘베놈’과 완벽한 파트너가 된 ‘에디 브록’(톰 하디) 앞에 ‘클리터스 캐서디’(우디 해럴슨)가 ‘카니지’로 등장,
                    앞으로 닥칠 대혼돈의 세상을 예고한다. 대혼돈의 시대가 시작되고, 악을 악으로 처단할 것인가?"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="소울"
                    image="https://movie-phinf.pstatic.net/20210107_160/1609984702837oNdmw_JPEG/movie_image.jpg"
                    link="https://youtu.be/Q0zFPlArth0"
                    release="2021.01.20."
                    audience={2048228}
                    tmeter={95} tscore={88}
                    mscore={83} mreview={8.2}
                    boxoffice={120957731}
                    award="21아카데미 , 골든글로브 장편 애니메이션상"
                    actor="제이미 폭스(조 가드너 목소리), 티나 페이(22 목소리), 다비드 딕스(파울 목소리)"
                    story="뉴욕에서 음악 선생님으로 일하던 ‘조’는 꿈에 그리던 최고의 밴드와 재즈 클럽에서 연주하게 된 그 날,
                    예기치 못한 사고로 영혼이 되어 ‘태어나기 전 세상’에 떨어진다. 탄생 전 영혼들이 멘토와 함께 자신의 관심사를 발견하면 
                    지구 통행증을 발급하는 ‘태어나기 전 세상’ ‘조’는 그 곳에서 유일하게 지구에 가고 싶어하지 않는 시니컬한 영혼 ‘22’의 멘토가 된다.
                    링컨, 간디, 테레사 수녀도 멘토되길 포기한 영혼 ‘22’ 꿈의 무대에 서려면 ‘22’의 지구 통행증이 필요한 ‘조’
                    그는 다시 지구로 돌아가 꿈의 무대에 설 수 있을까?"
                />
                <Movie
                    rank="10"
                    name="크루엘라"
                    image="https://movie-phinf.pstatic.net/20210512_139/1620799657168vGIqq_JPEG/movie_image.jpg"
                    link="https://youtu.be/yfSMTFzw-Kw"
                    release="2021.05.26."
                    audience={1983396}
                    tmeter={74} tscore={97}
                    mscore={59} mreview={7.1}
                    boxoffice={233274812}
                    award="2021 People's choice Awards"
                    actor="엠마 스톤(크루엘라)"
                    story="처음부터 난 알았어. 내가 특별하단 걸 그게 불편한 인간들도 있겠지만 모두의 비위를 맞출 수는 없잖아?
                    그러다 보니 결국, 학교를 계속 다닐 수가 없었지 우여곡절 런던에 오게 된 나, 에스텔라는 재스퍼와 호레이스를 운명처럼 만났고
                    나의 뛰어난 패션 감각을 이용해 완벽한 변장과 빠른 손놀림으로 런던 거리를 싹쓸이 했어
                    도둑질이 지겹게 느껴질 때쯤, 꿈에 그리던 리버티 백화점에 낙하산(?)으로 들어가게 됐어
                    거리를 떠돌았지만 패션을 향한 나의 열정만큼은 언제나 진심이었거든 근데 이게 뭐야, 옷에는 손도 못 대보고 하루 종일 바닥 청소라니
                    인내심에 한계를 느끼고 있을 때, 런던 패션계를 꽉 쥐고 있는 남작 부인이 나타났어
                    천재는 천재를 알아보는 법! 난 남작 부인의 브랜드 디자이너로 들어가게 되었지
                    꿈을 이룰 것 같았던 순간도 잠시, 세상에 남작 부인이 ‘그런 사람’이었을 줄이야… 그래서 난 내가 누군지 보여주기로 했어
                    잘가, 에스텔라 난 이제 크루엘라야!"
                />
            </div>
        </div>
    );
}
export default List2021;