import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2018() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="신과함께- 인과 연 🥇"
                    image="https://movie-phinf.pstatic.net/20201230_128/1609305001387CUHXK_JPEG/movie_image.jpg"
                    link="https://youtu.be/amXcMw8cJZk"
                    release="2018.08.01."
                    audience={12278010}
                    tmeter={44} tscore={76}
                    mscore={0} mreview={7.5}
                    boxoffice={110994414}
                    award="프렌차이즈 2600만 / 2019 올해의 영화상"
                    actor="하정우(강림), 주지훈(해원맥), 김향기(덕춘)"
                    story="천 년 동안 48명의 망자를 환생시킨 저승 삼차사, 한 명만 더 환생시키면 그들도 새로운 삶을 얻을 수 있다.
                    하지만 강림(하정우)은 원귀였던 수홍(김동욱)을 자신들의 마지막 귀인으로 정하는 이해할 수 없는 선택을 한다.
                    저승법 상 원귀는 소멸되어야 마땅하나 염라대왕(이정재)은 저승 삼차사에게 새로운 조건을 내걸며 강림의 제안을 수락한다.
                    염라의 조건은 성주신(마동석)이 버티고 있어 저승 차사들이 가는 족족 실패하는 허춘삼 노인을 수홍의 재판이 끝나기 전까지 저승으로 데려오는 것.
                    허춘삼을 데리러 이승으로 내려간 해원맥(주지훈)과 덕춘(김향기), 하지만 성주신의 막강한 힘 앞에 속수무책으로 당하기만 하던 중 우연히 그가 천 년 전 과거에 해원맥과 덕춘을 저승으로 데려간 저승 차사였다는 사실을 알게 된다.
                    스스로도 기억 못 하는 과거에 대한 호기심으로 해원맥과 덕춘은 성주신과 거래를 시작하는데…"
                />
                <Movie
                    rank="2"
                    name="어벤져스: 인피니티 워 🥈"
                    image="https://movie-phinf.pstatic.net/20180322_242/15216962441485x5Om_JPEG/movie_image.jpg"
                    link="https://youtu.be/F0kvfk1ghjA"
                    release="2018.04.25."
                    audience={11233176}
                    tmeter={85} tscore={91}
                    mscore={68} mreview={8.7}
                    boxoffice={2048359754}
                    award="2018 세계 TOP 1 / 역대 박스오피스 5위"
                    actor="로버트 다우니 주니어(토니 스타크/아이언맨), 조슈 브롤린(타노스), 크리스 헴스워스(토르)"
                    story="새로운 조합을 이룬 어벤져스, 역대 최강 빌런 타노스에 맞서 세계의 운명이 걸린
                    인피니티 스톤을 향한 무한 대결이 펼쳐진다! 마블의 클라이맥스를 목격하라!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="보헤미안 랩소디 🥉"
                    image="https://movie-phinf.pstatic.net/20181213_264/1544692854634ss65r_JPEG/movie_image.jpg"
                    link="https://youtu.be/XTZko22Ze3o"
                    release="2018.10.31."
                    audience={9948386}
                    tmeter={61} tscore={85}
                    mscore={49} mreview={7.8}
                    boxoffice={911902649}
                    award="19골든글로브 작품상 / 19아카데미 남우주연상"
                    actor="라미 말렉(프레디 머큐리), 루시 보인턴(메리 오스틴), 귈림 리(브라이언 메이)"
                    story="공항에서 수하물 노동자로 일하며 음악의 꿈을 키우던 이민자 출신의 아웃사이더 ‘파록버사라’
                    보컬을 구하던 로컬 밴드에 들어가게 되면서 ‘프레디 머큐리’라는 이름으로 밴드 ‘퀸’을 이끌게 된다.
                    시대를 앞서가는 독창적인 음악과 화려한 퍼포먼스로 관중들을 사로잡으며 성장하던 ‘퀸’은
                    라디오와 방송에서 외면을 받을 것이라는 음반사의 반대에도 불구하고
                    무려 6분 동안 이어지는 실험적인 곡 ‘보헤미안 랩소디’로 대성공을 거두며 월드스타 반열에 오른다.
                    그러나 독보적인 존재감을 뿜어내던 ‘프레디 머큐리’는 솔로 데뷔라는 유혹에 흔들리게 되고
                    결국 오랜 시간 함께 해왔던 멤버들과 결별을 선언하게 되는데…"
                />
                <Movie
                    rank="4"
                    name="미션 임파서블: 폴아웃"
                    image="https://movie-phinf.pstatic.net/20180523_234/1527043720337JCQAP_JPEG/movie_image.jpg"
                    link="https://youtu.be/XiHiW4N7-bo"
                    release="2018.07.25."
                    audience={6584915}
                    tmeter={97} tscore={88}
                    mscore={86} mreview={8.4}
                    boxoffice={791115104}
                    award="1996 ~ ING / 역대 프렌차이즈 영화 4위"
                    actor="톰 크루즈(에단 헌트), 헨리 카빌(어거스트 워커), 사이먼 페그(벤지 던)"
                    story="도난당한 핵무기를 되찾아 오는 위험천만한 작전 중, 에단 헌트(톰 크루즈)는 임무를 포기하고, 팀원의 목숨을 구하는 선택을 한다.
                    이제, 핵무기는 문명을 무너뜨리려는 사악한 테러조직의 손에 넘어갔다.
                    세계를 멸망시킬 핵 재앙을 막기 위해 세계 최강 스파이기관, IMF의 에단 헌트와 정예 요원들(사이먼 페크, 빙 라메스, 레베카 퍼거슨)은 
                    숙명의 라이벌, 중앙정보국 CIA의 상급 요원(헨리 카빌)과 불편한 동맹을 맺어야만 한다."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="쥬라기 월드: 폴른 킹덤"
                    image="https://movie-phinf.pstatic.net/20180814_31/1534222196427nyBw8_JPEG/movie_image.jpg"
                    link="https://youtu.be/e5QIs571zzQ"
                    release="2018.06.06."
                    audience={5661128}
                    tmeter={47} tscore={48}
                    mscore={51} mreview={5.6}
                    boxoffice={1310466296}
                    award="2018 세계 TOP 3 / 역대 박스오피스 16위"
                    actor="크리스 프랫(오웬 그래디), 브라이스 달라스 하워드(클레어 디어링)"
                    story="지상 최대의 테마파크 ‘쥬라기 월드’가 폐쇄된 이후 화산 폭발 조짐이 일어나자, 오웬(크리스 프랫)과 클레어(브라이스 달라스 하워드)는 공룡들의 멸종을 막기 위해
                    이슬라 누블라 섬으로 떠난다. 한편, 진화된 공룡들을 이용하려는 세력의 거대한 음모가 드러나고,
                    절대 지상에 존재해선 안될 위협적 공룡들이 마침내 세상 밖으로 등장하게 되는데…"
                />
                <Movie
                    rank="6"
                    name="앤트맨과 와스프"
                    image="https://movie-phinf.pstatic.net/20180530_170/1527645793223uhWgz_JPEG/movie_image.jpg"
                    link="https://youtu.be/BubTvW_T2YM"
                    release="2018.07.04."
                    audience={5448134}
                    tmeter={87} tscore={75}
                    mscore={70} mreview={7.1}
                    boxoffice={622674139}
                    award="18 MCU 국내 누적관객 1억 돌파"
                    actor="출연폴 러드(스캇 랭/앤트맨), 에반젤린 릴리(호프 반 다인/와스프)"
                    story="‘시빌 워’ 사건 이후 은둔하며 히어로와 가장의 역할 사이에서 고민 중이던 ‘앤트맨’과 새로운 파트너 ‘와스프’ 앞에 정체불명의 빌런 ‘고스트’가 등장한다.
                    시공간의 개념이 사라진 양자 영역으로 들어갈 수 있는 기술을 훔쳐 달아난 고스트를 쫓던 앤트맨과 와스프는 상상도 못했던 상황에 직면하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="안시성"
                    image="https://movie-phinf.pstatic.net/20180919_108/1537322093089VIq7d_JPEG/movie_image.jpg"
                    link="https://youtu.be/VpWZiscDYuk"
                    release="2018.09.19."
                    audience={5441020}
                    tmeter={0} tscore={83}
                    mscore={0} mreview={0}
                    boxoffice={40877282}
                    award="18청룡영화상 신인남우상 / 20대종상 의상상"
                    actor="조인성(양만춘), 남주혁(사물), 박성웅(이세민)"
                    story="천하를 손에 넣으려는 당 태종은 수십만 대군을 동원해 고구려의 변방 안시성을 침공한다. 20만 당나라 최강 대군 VS 5천명의 안시성 군사들.
                    40배의 전력 차이에도 불구하고, 안시성 성주 양만춘과 전사들은 당나라에 맞서 싸우기로 결심하는데…"
                />
                <Movie
                    rank="8"
                    name="블랙 팬서"
                    image="https://movie-phinf.pstatic.net/20180103_128/1514946690065uYxwW_JPEG/movie_image.jpg"
                    link="https://youtu.be/k0DF4LSG1z8"
                    release="2018.02.14."
                    audience={5399327}
                    tmeter={96} tscore={79}
                    mscore={88} mreview={6.4}
                    boxoffice={1347597973}
                    award="18아카데미 3관왕 / SAGs 베스트 앙상블"
                    actor="채드윅 보스만(티찰라 / 블랙 팬서)"
                    story="‘시빌 워’ 이후 와칸다의 왕위를 계승한 티찰라(채드윅 보스만)는 와칸다에만 존재하는 최강 희귀 금속 ‘비브라늄’과
                    왕좌를 노리는 숙적들의 음모가 전세계적인 위협으로 번지자 세상을 구할 히어로 ‘블랙 팬서’로서 피할 수 없는 전쟁에 나서는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="완벽한 타인"
                    image="https://movie-phinf.pstatic.net/20181106_289/1541478936071tmadh_JPEG/movie_image.jpg"
                    link="https://youtu.be/-UWdeFywycs"
                    release="2018.10.31."
                    audience={5294155}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={32475704}
                    award="19황금촬영상 최우수 남우조연상"
                    actor="유해진(태수), 조진웅(석호), 이서진(준모)"
                    story="오랜만의 커플 모임에서 한 명이 게임을 제안한다. 바로 각자의 핸드폰을 테이블 위에 올려두고
                    통화 내용부터 문자와 이메일까지 모두 공유하자고 한 것. 흔쾌히 게임을 시작하게 된 이들의 비밀이 핸드폰을 통해 들통나면서
                    처음 게임을 제안했던 것과는 전혀 다른 상상치 못한 결말로 흘러가는데…"
                />
                <Movie
                    rank="10"
                    name="독전"
                    image="https://movie-phinf.pstatic.net/20180524_197/1527129752646aGAH7_JPEG/movie_image.jpg"
                    link="https://youtu.be/8asOmw3UnMw"
                    release="2018.05.22."
                    audience={5202194}
                    tmeter={82} tscore={65}
                    mscore={58} mreview={0}
                    boxoffice={39047153}
                    award="18청룡, 대종상, 20백상 남우조연상"
                    actor="조진웅(원호), 류준열(락), 김주혁(진하림)"
                    story="의문의 폭발 사고 후, 오랫동안 마약 조직을 추적해온 형사 ‘원호’(조진웅)의 앞에 조직의 후견인 ‘오연옥’(김성령)과 버림받은 조직원 ‘락’(류준열)이 나타난다.
                    그들의 도움으로 아시아 마약 시장의 거물 ‘진하림’(김주혁)과 조직의 숨겨진 인물 ‘브라이언’(차승원)을 만나게 되면서
                    그 실체에 대한 결정적 단서를 잡게 되는데…"
                />
            </div>
        </div>
    );
}
export default List2018;