import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2019() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="극한직업 🥇"
                    image="https://movie-phinf.pstatic.net/20190116_206/1547615429111dINWj_JPEG/movie_image.jpg"
                    link="https://youtu.be/xM1CIQd_X4c"
                    release="2019.01.23."
                    audience={16266338}
                    tmeter={82} tscore={80}
                    mscore={0} mreview={0}
                    boxoffice={123622755}
                    award="역대 국산영화 2위 / 국내 역대 매출 1위"
                    actor="류승룡(고반장), 이하늬(장형사), 진선규(마형사)"
                    story="불철주야 달리고 구르지만 실적은 바닥, 급기야 해체 위기를 맞는 마약반!
                    더 이상 물러설 곳이 없는 팀의 맏형 고반장은 국제 범죄조직의 국내 마약 밀반입 정황을 포착하고
                    장형사, 마형사, 영호, 재훈까지 4명의 팀원들과 함께 잠복 수사에 나선다.
                    마약반은 24시간 감시를 위해 범죄조직의 아지트 앞 치킨집을 인수해 위장 창업을 하게 되고,
                    뜻밖의 절대미각을 지닌 마형사의 숨은 재능으로 치킨집은 일약 맛집으로 입소문이 나기 시작한다.
                    수사는 뒷전, 치킨장사로 눈코 뜰 새 없이 바빠진 마약반에게 어느 날 절호의 기회가 찾아오는데…"
                />
                <Movie
                    rank="2"
                    name="어벤져스: 엔드 게임 🥈"
                    image="https://movie-phinf.pstatic.net/20190417_250/1555465284425i6WQE_JPEG/movie_image.jpg"
                    link="https://youtu.be/TaCE5sAigGQ"
                    release="2019.04.24."
                    audience={13977602}
                    tmeter={94} tscore={90}
                    mscore={78} mreview={7.8}
                    boxoffice={2797501328}
                    award="2019 세계 TOP 1 / 역대 박스오피스 2위"
                    actor="로버트 다우니 주니어(토니 스타크/아이언맨), 크리스 에반스(스티브 로저스/캡틴 아메리카)"
                    story="인피니티 워 이후 절반만 살아남은 지구 마지막 희망이 된 어벤져스
                    먼저 떠난 그들을 위해 모든 것을 걸었다! 위대한 어벤져스 운명을 바꿀 최후의 전쟁이 펼쳐진다!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="겨울왕국2 🥉"
                    image="https://movie-phinf.pstatic.net/20191121_221/1574298335357mqgLk_JPEG/movie_image.jpg"
                    link="https://youtu.be/eSEs4B4H-EA"
                    release="2019.11.21."
                    audience={13747792}
                    tmeter={78} tscore={93}
                    mscore={64} mreview={6.9}
                    boxoffice={1450026933}
                    award="역대 애니메이션 1위 / 역대 박스오피스 10위"
                    actor="크리스틴 벨(안나 목소리), 이디나 멘젤(엘사 목소리)"
                    story="어느 날 부턴가 의문의 목소리가 엘사를 부르고, 평화로운 아렌델 왕국을 위협한다. 트롤은 모든 것은 과거에서 시작되었음을 알려주며 엘사의 힘의 비밀과 진실을 찾아 떠나야한다고 조언한다.
                    위험에 빠진 아렌델 왕국을 구해야만 하는 엘사와 안나는 숨겨진 과거의 진실을 찾아 크리스토프, 올라프 그리고 스벤과 함께 위험천만한 놀라운 모험을 떠나게 된다.
                    자신의 힘을 두려워했던 엘사는 이제 이 모험을 헤쳐나가기에 자신의 힘이 충분하다고 믿어야만 하는데…"
                />
                <Movie
                    rank="4"
                    name="알라딘"
                    image="https://movie-phinf.pstatic.net/20190524_104/1558663170174Q2mmw_JPEG/movie_image.jpg"
                    link="https://youtu.be/KrM3vS5sy2w"
                    release="2019.05.23."
                    audience={12723777}
                    tmeter={57} tscore={94}
                    mscore={53} mreview={6.7}
                    boxoffice={1050693953}
                    award="역대 뮤지컬 박스오피스 3위"
                    actor="메나 마수드(알라딘), 윌 스미스(지니), 나오미 스콧(자스민)"
                    story="머나먼 사막 속 신비의 아그라바 왕국의 시대. 좀도둑 ‘알라딘’은 마법사 ‘자파’의 의뢰로 마법 램프를 찾아 나섰다가
                    주인에게 세 가지 소원을 들어주는 지니를 만나게 되고, 자스민 공주의 마음을 얻으려다 생각도 못했던 모험에 휘말리게 되는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="기생충"
                    image="https://movie-phinf.pstatic.net/20190528_36/1559024198386YVTEw_JPEG/movie_image.jpg"
                    link="https://youtu.be/jBdRhhSt3Bc"
                    release="2019.05.30."
                    audience={10313163}
                    tmeter={98} tscore={90}
                    mscore={96} mreview={8.9}
                    boxoffice={263020130}
                    award="19칸 황금종려상 / 20아카데미 4관왕"
                    actor="송강호(기택), 이선균(동익), 조여정(연교)"
                    story="전원백수로 살 길 막막하지만 사이는 좋은 기택(송강호) 가족. 장남 기우(최우식)에게 명문대생 친구가 연결시켜 준 고액 과외 자리는
                    모처럼 싹튼 고정수입의 희망이다. 온 가족의 도움과 기대 속에 박사장(이선균) 집으로 향하는 기우.
                    글로벌 IT기업 CEO인 박사장의 저택에 도착하자 젊고 아름다운 사모님 연교(조여정)가 기우를 맞이한다.
                    그러나 이렇게 시작된 두 가족의 만남 뒤로, 걷잡을 수 없는 사건이 기다리고 있었으니…"
                />
                <Movie
                    rank="6"
                    name="엑시트"
                    image="https://movie-phinf.pstatic.net/20190724_161/1563931152464tk11A_JPEG/movie_image.jpg"
                    link="https://youtu.be/li4jOV5j7SI"
                    release="2019.07.31."
                    audience={9426421}
                    tmeter={83} tscore={94}
                    mscore={0} mreview={7.5}
                    boxoffice={69501772}
                    award="19청룡영화상 감독상/20백상예술대상 각본상"
                    actor="조정석(용남), 윤아(의주)"
                    story="대학교 산악 동아리 에이스 출신이지만 졸업 후 몇 년째 취업 실패로 눈칫밥만 먹는 용남은
                    온 가족이 참석한 어머니의 칠순 잔치에서 연회장 직원으로 취업한 동아리 후배 의주를 만난다
                    어색한 재회도 잠시, 칠순 잔치가 무르익던 중 의문의 연기가 빌딩에서 피어 오르며
                    피할 새도 없이 순식간에 도심 전체는 유독가스로 뒤덮여 일대혼란에 휩싸이게 된다.
                    용남과 의주는 산악 동아리 시절 쌓아 뒀던 모든 체력과 스킬을 동원해
                    탈출을 향한 기지를 발휘하기 시작하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="백두산"
                    image="https://movie-phinf.pstatic.net/20191219_263/15767415637757HPgg_JPEG/movie_image.jpg"
                    link="https://youtu.be/FKAbTcss1ow"
                    release="2019.12.19."
                    audience={8252909}
                    tmeter={71} tscore={74}
                    mscore={0} mreview={0}
                    boxoffice={61255955}
                    award="20대종상 2관왕 / 21청룡영화상 기술상"
                    actor="이병헌(리준평), 하정우(조인창), 마동석(강봉래)"
                    story="대한민국 관측 역사상 최대 규모의 백두산 폭발 발생. 갑작스러운 재난에 한반도는 순식간에 아비규환이 되고, 남과 북 모두를 집어삼킬 추가 폭발이 예측된다.
                    사상 초유의 재난을 막기 위해 ‘전유경’(전혜진)은 백두산 폭발을 연구해 온 지질학 교수 ‘강봉래’(마동석)의 이론에 따른 작전을 계획하고,
                    전역을 앞둔 특전사 EOD 대위 ‘조인창’(하정우)이 남과 북의 운명이 걸린 비밀 작전에 투입된다. 작전의 키를 쥔 북한 무력부 소속 일급 자원 ‘리준평’(이병헌)과 접선에 성공한 ‘인창’.
                    하지만 ‘준평’은 속을 알 수 없는 행동으로 ‘인창’을 곤란하게 만든다. 한편, ‘인창’이 북한에서 펼쳐지는 작전에 투입된 사실도 모른 채
                    서울에 홀로 남은 ‘최지영’(배수지)은 재난에 맞서 살아남기 위해 고군분투하고 그 사이, 백두산 마지막 폭발까지의 시간은 점점 가까워 가는데…!"
                />
                <Movie
                    rank="8"
                    name="스파이더맨: 파 프롬 홈"
                    image="https://movie-phinf.pstatic.net/20190527_181/1558933159657a210P_JPEG/movie_image.jpg"
                    link="https://youtu.be/VUFmhKpZKlE"
                    release="2019.07.02."
                    audience={8023606}
                    tmeter={90} tscore={95}
                    mscore={69} mreview={7.4}
                    boxoffice={1131927996}
                    award="19MCU 10억달러 트리플크라운"
                    actor="톰 홀랜드(피터 파커/스파이더맨 ), 사무엘 L. 잭슨(닉 퓨리), 젠데이아 콜먼(MJ)"
                    story="‘엔드게임’ 이후 변화된 세상, 스파이더맨 ‘피터 파커’는 학교 친구들과 유럽 여행을 떠나게 된다.
                    그런 그의 앞에 ‘닉 퓨리’가 등장해 도움을 요청하고 정체불명의 조력자 ‘미스테리오’까지 합류하게 되면서
                    전 세계를 위협하는 새로운 빌런 ‘엘리멘탈 크리쳐스’와 맞서야만 하는 상황에 놓이게 되는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="캡틴 마블"
                    image="https://movie-phinf.pstatic.net/20190225_72/1551069530582h2huX_JPEG/movie_image.jpg"
                    link="https://youtu.be/n1Xz13zlWWw"
                    release="2019.03.06."
                    audience={5802810}
                    tmeter={79} tscore={46}
                    mscore={64} mreview={3.5}
                    boxoffice={1128462972}
                    award="역대 오프닝 박스오피스 8위"
                    actor="브리 라슨(캐럴 댄버스/캡틴 마블), 사무엘 L. 잭슨(닉 퓨리), 벤 멘델슨(탈로스/켈러)"
                    story="1995년, 공군 파일럿 시절의 기억을 잃고 크리족 전사로 살아가던 캐럴 댄버스(브리 라슨)가 지구에 불시착한다.
                    쉴드 요원 닉 퓨리(사무엘 L. 잭슨)에게 발견되어 팀을 이룬 그들은 지구로 향하는 더 큰 위협을 감지하고
                    힘을 합쳐 전쟁을 끝내야 하는데…"
                />
                <Movie
                    rank="10"
                    name="조커"
                    image="https://movie-phinf.pstatic.net/20190906_128/1567761736426S6Fje_JPEG/movie_image.jpg"
                    link="https://youtu.be/x60mB0zXZ38"
                    release="2019.10.02."
                    audience={5255308}
                    tmeter={68} tscore={88}
                    mscore={59} mreview={9.0}
                    boxoffice={1074419384}
                    award="20아카데미 남우주연상 - 호아킨 피닉스"
                    actor="호아킨 피닉스(아서 플렉/조커)"
                    story="고담시의 광대 아서 플렉은 코미디언을 꿈꾸는 남자. 하지만 모두가 미쳐가는 코미디 같은 세상에서
                    맨 정신으로는 그가 설 자리가 없음을 깨닫게 되는데… 이제껏 본 적 없는 진짜 ‘조커’를 만나라!"
                />
            </div>
        </div>
    );
}
export default List2019;