import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2020() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="남산의 부장들 🥇"
                    image="https://movie-phinf.pstatic.net/20200103_41/1578032244761ejKMX_JPEG/movie_image.jpg"
                    link="https://youtu.be/FqyHdERatW8"
                    release="2020.01.22."
                    audience={4750345}
                    tmeter={88} tscore={100}
                    mscore={0} mreview={0}
                    boxoffice={34226000}
                    award="2020 국산 TOP 1 / 20청룡영화상 최우수작품상"
                    actor="이병헌(김규평), 이성민(박통), 곽도원(박용각)"
                    story="1979년 10월 26일, 중앙정보부장 김규평(이병헌)이 대한민국 대통령을 암살한다.
                    이 사건의 40일전, 미국에서는 전 중앙정보부장 박용각(곽도원)이 청문회를 통해 전 세계에 정권의 실체를 고발하며 파란을 일으킨다.
                    그를 막기 위해 중앙정보부장 김규평과 경호실장 곽상천(이희준)이 나서고, 대통령 주변에는 충성 세력과 반대 세력들이 뒤섞이기 시작하는데…"
                />
                <Movie
                    rank="2"
                    name="다만 악에서 구하소서 🥈"
                    image="https://movie-phinf.pstatic.net/20200706_191/1594001490577tifkl_JPEG/movie_image.jpg"
                    link="https://youtu.be/OoHlIPrt88s"
                    release="2020.08.05."
                    audience={4357803}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={34217377}
                    award="20청룡영화상 남우조연상"
                    actor="황정민(인남), 이정재(레이), 박정민(유이)"
                    story="태국에서 충격적인 납치사건이 발생하고 마지막 청부살인 미션을 끝낸 암살자 인남(황정민)은 그것이 자신과 관계된 것임을 알게 된다.
                    인남은 곧바로 태국으로 향하고, 조력자 유이(박정민)를 만나 사건을 쫓기 시작한다. 한편, 자신의 형제가 인남에게 암살당한 것을 알게 된 레이(이정재).
                    무자비한 복수를 계획한 레이는 인남을 추격하기 위해 태국으로 향하는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="반도 🥉"
                    image="https://movie-phinf.pstatic.net/20200624_137/15929908359489lOON_JPEG/movie_image.jpg"
                    link="https://youtu.be/fcueArgm800"
                    release="2020.07.15."
                    audience={3812455}
                    tmeter={53} tscore={76}
                    mscore={51} mreview={5.1}
                    boxoffice={42698327}
                    award="2020 칸 국제영화제 초청작"
                    actor="강동원(한정석), 이정현(민정)"
                    story="4년 전, 나라 전체를 휩쓸어버린 전대미문의 재난에서 가까스로 탈출했던 ‘정석’(강동원). 바깥세상으로부터 철저히 고립된 반도에 다시 들어가야 하는 피할 수 없는 제안을 받는다.
                    제한 시간 내에 지정된 트럭을 확보해 반도를 빠져 나와야 하는 미션을 수행하던 중 인간성을 상실한 631부대와 4년 전보다 더욱 거세진 대규모 좀비 무리가 정석 일행을 습격한다.
                    절체절명의 순간, 폐허가 된 땅에서 살아남은 ‘민정’(이정현) 가족의 도움으로 위기를 가까스로 모면하고
                    이들과 함께 반도를 탈출할 수 있는 마지막 기회를 잡기로 한다."
                />
                <Movie
                    rank="4"
                    name="히트맨"
                    image="https://movie-phinf.pstatic.net/20200122_181/15796574636309Fux2_JPEG/movie_image.jpg"
                    link="https://youtu.be/NFebPZqj8QI"
                    release="2020.01.22."
                    audience={2406232}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={17601351}
                    award="2020 국산 TOP 4"
                    actor="권상우(준), 정준호(덕규), 황우슬혜(미나)"
                    story="웹툰 작가가 되고 싶어 국정원을 탈출한 비밀 프로젝트 방패연 출신 전설의 암살요원 '준'.
                    그러나 현실은 연재하는 작품마다 역대급 악플만 받을 뿐이다. 술김에 그리지 말아야 할 1급 기밀을 그려버리고
                    예상치 않게 웹툰은 하루아침에 초대박이 나지만, 그로 인해 '준'은 국정원과 테러리스트의 더블 타깃이 되는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="테넷"
                    image="https://movie-phinf.pstatic.net/20200728_86/15959209130236RePy_JPEG/movie_image.jpg"
                    link="https://youtu.be/7oKAPbnl7mQ"
                    release="2020.08.26."
                    audience={2001171}
                    tmeter={69} tscore={76}
                    mscore={69} mreview={7.2}
                    boxoffice={362929000}
                    award="2021 세계 TOP 5"
                    actor="존 데이비드 워싱턴(주도자), 로버트 패틴슨(닐), 엘리자베스 데비키(캣)"
                    story="시간의 흐름을 뒤집는 인버전을 통해 현재와 미래를 오가며 세상을 파괴하려는 사토르(케네스 브래너)를 막기 위해 투입된 
                    작전의 주도자(존 데이비드 워싱턴). 인버전에 대한 정보를 가진 닐(로버트 패틴슨)과 미술품 감정사이자 사토르에 대한 복수심이 가득한 
                    그의 아내 캣(엘리자베스 데비키)과 협력해 미래의 공격에 맞서 제3차 세계대전을 막아야 한다!"
                />
                <Movie
                    rank="6"
                    name="#살아있다"
                    image="https://movie-phinf.pstatic.net/20200624_189/1592965781317Puv47_JPEG/movie_image.jpg"
                    link="https://youtu.be/ifyPEnKreJI"
                    release="2020.06.24."
                    audience={1903992}
                    tmeter={88} tscore={62}
                    mscore={0} mreview={0}
                    boxoffice={13432212}
                    award="20.9월 Netflix 글로벌 차트 1위"
                    actor="유아인(오준우), 박신혜(김유빈)"
                    story="원인불명 증세의 사람들의 공격에 통제 불능에 빠진 도시. 영문도 모른 채 잠에서 깬 ‘준우’(유아인)는 아무도 없는 집에 혼자 고립된 것을 알게 된다.
                    데이터, 와이파이, 문자, 전화 모든 것이 끊긴 채 고립된 상황. 연락이 두절된 가족에 이어 최소한의 식량마저 바닥이 나자 더 이상 버티기 힘들어진 ‘준우’.
                    하지만 그 순간 건너편 아파트에서 누군가 시그널을 보내온다. 또 다른 생존자 ‘유빈’(박신혜)이 아직 살아있음을 알게 된 ‘준우’는
                    함께 살아남기 위한 방법을 찾아 나서는데...!"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="강철비2 : 정상회담"
                    image="https://movie-phinf.pstatic.net/20200703_48/1593739617223iuD2b_JPEG/movie_image.jpg"
                    link="https://youtu.be/KKPUEANoHAo"
                    release="2020.07.29."
                    audience={1809989}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={12235367}
                    award="20한국영제협 남우조연상"
                    actor="정우성(한 대통령), 곽도원(호위총국장), 유연석(북 위원장)"
                    story="북미 평화협정 체결을 위한 대한민국 대통령(정우성), 북한의 최고지도자인 위원장(유연석)과 미국 대통령(앵거스 맥페이든)간의
                     남북미 정상회담이 북한 원산에서 열린다. 북미 사이 좀처럼 이견이 좁혀지지 않는 가운데, 핵무기 포기와 평화체제 수립에 반발하는 
                     북 호위총국장(곽도원)의 쿠데타가 발생하고, 납치된 세 정상은 북한 핵잠수함에 인질로 갇힌다. 그리고, 좁디 좁은 함장실 안, 
                     예기치 못한 진정한 정상회담이 벌어지게 되는데…"
                />
                <Movie
                    rank="8"
                    name="담보"
                    image="https://movie-phinf.pstatic.net/20200929_240/1601370752754trKxu_JPEG/movie_image.jpg"
                    link="https://youtu.be/OVXSptyR5Gc"
                    release="2020.09.29."
                    audience={1719593}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={14193957}
                    award="21황금촬영상 남우조연상"
                    actor="성동일(두석), 하지원(승이), 김희원(종배)"
                    story="1993년 인천 거칠고 까칠한 사채업자 두석(성동일)과 종배(김희원)는 떼인 돈 받으러 갔다가 얼떨결에 9살 승이(박소이)를 담보로 맡게 된다.
                    “담보가 무슨 뜻이에요?” 뜻도 모른 채 담보가 된 승이와 승이 엄마의 사정으로 아이의 입양까지 책임지게 된 두석과 종배.
                    하지만 부잣집으로 간 줄 알았던 승이가 엉뚱한 곳에 있다는 것을 알게 된 두 사람은 승이를 데려와 돌보게 된다.
                    예고 없이 찾아온 아이에게 인생을 담보 잡힌 두석과 종배. 빚 때문에 아저씨들에게 맡겨진 담보 승이. 두석, 종배, 승이 세 사람은 어느덧 서로에게 특별한 존재가 되는데.."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="닥터 두리틀"
                    image="https://movie-phinf.pstatic.net/20191226_207/1577328208589oxfYb_JPEG/movie_image.jpg"
                    link="https://youtu.be/gTLpDaGm7-Y"
                    release="2020.01.08."
                    audience={1607082}
                    tmeter={13} tscore={76}
                    mscore={26} mreview={4.8}
                    boxoffice={245442440}
                    award="2021 세계 TOP 7"
                    actor="로버트 다우니 주니어(닥터 두리틀)"
                    story="동물들과 소통하는 특별한 능력을 지닌 닥터 두리틀(로버트 다우니 주니어)은 사랑하는 사람을 잃고 세상과 단절한 채 동물들과 친구가 되어 살아간다.
                    어느 날, 여왕에게 알 수 없는 불치병이 생기고 왕국마저 위험에 빠지게 되자, 그의 놀라운 능력만이 모든 것을 해결할 수 있음을 알게 된다.
                    세상을 구하기 위해서는 반드시 주어진 시간 안에 누구도 가보지 못했던 신비의 섬을 찾아내야만 하고, 두리틀은 친구들과 함께 위험천만한 모험을 떠나게 되는데…"
                />
                <Movie
                    rank="10"
                    name="삼진그룹 영어토익반"
                    image="https://movie-phinf.pstatic.net/20201021_273/16032618054109Yvje_JPEG/movie_image.jpg"
                    link="https://youtu.be/Vg8VH4BH6uo"
                    release="2020.10.21."
                    audience={1571924}
                    tmeter={0} tscore={0}
                    mscore={0} mreview={0}
                    boxoffice={12761386}
                    award="21백상예술대상 영화작품상"
                    actor="고아성(이자영), 이솜(정유나), 박혜수(심보람)"
                    story="입사 8년차 동기인 말단 여직원들이 ‘삼진그룹 영어토익반’에 모인다! 실무 능력 퍼펙트, 현실은 커피 타기 달인인 생산관리3부 오지랖 ‘이자영’(고아성),
                    추리소설 마니아로 뼈 때리는 멘트의 달인 마케팅부 돌직구 ‘정유나’(이솜), 수학 올림피아드 우승 출신, 실체는 가짜 영수증 메꾸기 달인 회계부 수학왕 ‘심보람’(박혜수)은
                    대리가 되면 진짜 ‘일’을 할 수 있을 것이라는 희망에 부푼다. 잔심부름을 하러 간 공장에서 검은 폐수가 유출되는 것을 목격한 ‘자영’은
                    ‘유나’, ‘보람’과 함께 회사가 무엇을 감추고자 하는지, 결정적 증거를 찾으려 한다. 불가능해 보이는 싸움, 세 친구는 해고의 위험을 무릅쓰고 고군분투를 시작하는데…"
                />
            </div>
        </div>
    );
}
export default List2020;