import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2014() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="명량 🥇"
                    image="https://movie-phinf.pstatic.net/20140721_186/1405911310756Tt2X1_JPEG/movie_image.jpg"
                    link="https://youtu.be/spQtwggaCy4"
                    release="2014.07.30."
                    audience={17615686}
                    tmeter={86} tscore={79}
                    mscore={0} mreview={6.4}
                    boxoffice={138342258}
                    award="역대 한국 박스오피스 관객수 1위"
                    actor="최민식(이순신), 류승룡(구루지마), 조진웅(와키자카)"
                    story="1597년 임진왜란 6년, 오랜 전쟁으로 인해 혼란이 극에 달한 조선. 무서운 속도로 한양으로 북상하는 왜군에 의해 국가존망의 위기에 처하자
                    누명을 쓰고 파면 당했던 이순신 장군(최민식)이 삼도수군통제사로 재임명된다. 하지만 그에게 남은 건 전의를 상실한 병사와 두려움에 가득 찬 백성,
                    그리고 12척의 배 뿐. 마지막 희망이었던 거북선마저 불타고 잔혹한 성격과 뛰어난 지략을 지닌 용병 구루지마(류승룡)가 왜군 수장으로 나서자 조선은 더욱 술렁인다.
                    330척에 달하는 왜군의 배가 속속 집결하고 압도적인 수의 열세에 모두가 패배를 직감하는 순간,
                    이순신 장군은 단 12척의 배를 이끌고 명량 바다를 향해 나서는데…!"
                />
                <Movie
                    rank="2"
                    name="국제시장 🥈"
                    image="https://movie-phinf.pstatic.net/20141124_107/141679124450580TTS_JPEG/movie_image.jpg"
                    link="https://youtu.be/BBEDtovULHY"
                    release="2014.12.17."
                    audience={14263980}
                    tmeter={71} tscore={85}
                    mscore={0} mreview={0}
                    boxoffice={99085291}
                    award="15대종상영화제 10관왕"
                    actor="황정민(덕수), 김윤진(영자), 오달수(달구)"
                    story="1950년대 한국전쟁 이후로부터 현재에 이르기까지 격변의 시대를 관통하며 살아온 우리 시대 아버지 ‘덕수’(황정민 분), 
                    그는 하고 싶은 것도 되고 싶은 것도 많았지만 평생 단 한번도 자신을 위해 살아본 적이 없다. ‘괜찮다’ 웃어 보이고 ‘다행이다’ 
                    눈물 훔치며 힘들었던 그때 그 시절, 오직 가족을 위해 굳세게 살아온 우리들의 아버지 이야기가 지금부터 시작된다."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="인터스텔라 🥉"
                    image="https://movie-phinf.pstatic.net/20160106_138/1452044846608eaFcJ_JPEG/movie_image.jpg"
                    link="https://youtu.be/d2VN6NNa9BE"
                    release="2014.11.06."
                    audience={10326240}
                    tmeter={72} tscore={86}
                    mscore={74} mreview={8.5}
                    boxoffice={701729206}
                    award="15아카데미 시각효과상"
                    actor="매튜 맥커너히(쿠퍼), 앤 해서웨이(브랜드), 마이클 케인(브랜드 교수)"
                    story="세계 각국의 정부와 경제가 완전히 붕괴된 미래가 다가온다. 지난 20세기에 범한 잘못이 전 세계적인 식량 부족을 불러왔고, NASA도 해체되었다.
                    이때 시공간에 불가사의한 틈이 열리고, 남은 자들에게는 이 곳을 탐험해 인류를 구해야 하는 임무가 지워진다.
                    사랑하는 가족들을 뒤로 한 채 인류라는 더 큰 가족을 위해, 그들은 이제 희망을 찾아 우주로 간다.
                    그리고 우린 답을 찾을 것이다. 늘 그랬듯이…"
                />
                <Movie
                    rank="4"
                    name="겨울왕국"
                    image="https://movie-phinf.pstatic.net/20170418_82/1492496178995pHxdA_JPEG/movie_image.jpg"
                    link="https://youtu.be/bbh1NIpDo-c"
                    release="개봉 2014.01.16. (해외 13.11.27.)"
                    audience={10303058}
                    tmeter={90} tscore={85}
                    mscore={74} mreview={7.5}
                    boxoffice={1281508100}
                    award="2013 세계 TOP 1 / 14아카데미 주제가상"
                    actor="크리스틴 벨(안나 목소리), 이디나 멘젤(엘사 목소리)"
                    story="서로가 최고의 친구였던 자매 ‘엘사’와 ‘안나’. 하지만 언니 ‘엘사’에게는 하나뿐인 동생에게조차 말 못할 비밀이 있다. 
                    모든 것을 얼려버리는 신비로운 힘이 바로 그것. ‘엘사’는 통제할 수 없는 자신의 힘이 두려워 왕국을 떠나고, 얼어버린 왕국의 저주를 풀기 위해 
                    ‘안나’는 언니를 찾아 환상적인 여정을 떠나는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="해적 : 바다로 간 산적"
                    image="https://movie-phinf.pstatic.net/20140624_33/1403574168649D3ow0_JPEG/movie_image.jpg"
                    link="https://youtu.be/qV7RgYARQQ8"
                    release="2014.08.06."
                    audience={8666208}
                    tmeter={57} tscore={53}
                    mscore={0} mreview={0}
                    boxoffice={64858224}
                    award="15백상예술대상 남자조연상"
                    actor="김남길(장사정), 손예진(여월)"
                    story="조선의 국새를 고래가 삼켜버렸다?! 전대미문 국새 강탈 사건으로 조정은 혼란에 빠지고,
                    이를 찾기 위해 조선의 난다긴다 하는 무리들이 바다로 모여든다! 바다를 호령하다 졸지에 국새 도둑으로 몰린 위기의 해적
                    고래는커녕 바다도 처음이지만 의기양양 고래사냥에 나선 산적 건국을 코앞에 두고 발등에 불이 떨어진 개국세력까지!
                    국새를 차지하는 자, 천하를 얻을 것이다!"
                />
                <Movie
                    rank="6"
                    name="수상한 그녀"
                    image="https://movie-phinf.pstatic.net/20140106_63/1388973931178nTp2e_JPEG/movie_image.jpg"
                    link="https://youtu.be/MBcZygdIGOU"
                    release="2014.01.22."
                    audience={8660651}
                    tmeter={80} tscore={88}
                    mscore={0} mreview={0}
                    boxoffice={58940254}
                    award="14백상예술대상 여자최우수인기상"
                    actor="심은경(오두리), 나문희(오말순), 박인환(박씨)"
                    story="아들 자랑이 유일한 낙인 욕쟁이 칠순 할매 오말순(나문희分)은 어느 날, 가족들이 자신을 요양원으로 독립(?)시키려 한다는 
                    청천벽력 같은 사실을 알게 된다. 뒤숭숭한 마음을 안고 밤길을 방황하던 할매 말순은 오묘한 불빛에 이끌려 ‘청춘 사진관’으로 들어간다. 
                    난생 처음 곱게 꽃단장을 하고 영정사진을 찍고 나오는 길, 그녀는 버스 차창 밖에 비친 자신의 얼굴을 보고 경악을 금치 못한다. 오드리 헵번처럼
                    뽀얀 피부, 날렵한 몸매... 주름진 할매에서 탱탱한 꽃처녀의 몸으로 돌아간 것! 아무도 알아보지 못하는 자신의 젊은 모습에 그녀는 스무살 ‘오두리’가 되어 
                    빛나는 전성기를 즐겨 보기로 마음 먹는데..."
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="트랜스포머 : 사라진시대"
                    image="https://movie-phinf.pstatic.net/20140530_75/1401415836092isDXh_JPEG/movie_image.jpg"
                    link="https://youtu.be/cU-dcTiHNHk"
                    release="2014.06.25."
                    audience={5295929}
                    tmeter={18} tscore={51}
                    mscore={32} mreview={4.4}
                    boxoffice={1104054072}
                    award="2014 세계 TOP 1"
                    actor="마크 월버그(케이드 예거), 니콜라 펠츠(테사 예거), 잭 레이너(셰인)"
                    story="시카고에서 벌어진 오토봇과 디셉티콘의 전투로 인해 수많은 사상자가 발생하고 도시가 처참하게 파괴되자
                    정부는 일부 오토봇을 제외한 트랜스포머에 대해 체포령을 내린다. 시카고 사태, 5년 후 대부분의 디셉티콘이 처벌되고 오토봇 역시 모습을 감춘 상황,
                    엔지니어 ‘케이드 예거’(마크 월버그)는 우연히 폐기 직전 고물차로 변해있던 ‘옵티머스 프라임’을 깨우게 된다. 그리고 그의 생존이 알려지자
                    ‘옵티머스 프라임’을 노리고 있던 어둠의 세력 역시 모습을 드러내기 시작한다. 전세계를 새로운 위협에 몰아넣을 거대한 음모,
                    사상 최대 가장 강력한 적에 맞서 ‘옵티머스 프라임’과 오토봇 군단은 목숨을 건 대결에 나서는데...!"
                />
                <Movie
                    rank="8"
                    name="님아, 그 강을 건너지 마오"
                    image="https://movie-phinf.pstatic.net/20141103_255/1414988497460e1QB6_JPEG/movie_image.jpg"
                    link="https://youtu.be/s95Ah6zU7lM"
                    release="2014.11.27."
                    audience={4802602}
                    tmeter={77} tscore={65}
                    mscore={68} mreview={0}
                    boxoffice={34106206}
                    award="독립영화 역대 흥행 1위"
                    actor="조병만, 강계열"
                    story="89세 소녀감성 강계열 할머니, 98세 로맨티스트 조병만 할아버지 이들은 어딜 가든 고운 빛깔의 커플 한복을 입고 두 손을 꼭 잡고 걷는 노부부이다.
                    봄에는 꽃을 꺾어 서로의 머리에 꽂아주고, 여름엔 개울가에서 물장구를 치고, 가을엔 낙엽을 던지며 장난을 치고, 겨울에는 눈싸움을 하는 매일이 신혼 같은 백발의 노부부.
                    장성한 자녀들은 모두 도시로 떠나고 서로를 의지하며 살던 어느 날, 할아버지가 귀여워하던 강아지 ‘꼬마’가 갑자기 세상을 떠난다.
                    꼬마를 묻고 함께 집으로 돌아온 이후부터 할아버지의 기력은 점점 약해져 가는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="군도 : 민란의 시대"
                    image="https://movie-phinf.pstatic.net/20140627_105/1403832280951tgmxv_JPEG/movie_image.jpg"
                    link="https://youtu.be/1j4B7zA0Ajk"
                    release="2014.07.23."
                    audience={4775811}
                    tmeter={82} tscore={68}
                    mscore={56} mreview={7.1}
                    boxoffice={35941291}
                    award="14청룡영화상 음악상, 촬영조명상"
                    actor="하정우(도치), 강동원(조윤)"
                    story="양반과 탐관오리들의 착취가 극에 달했던 조선 철종 13년. 힘 없는 백성의 편이 되어 세상을 바로잡고자 하는 의적떼인 군도(群盜), 지리산 추설이 있었다.
                    잦은 자연재해, 기근과 관의 횡포까지 겹쳐 백성들의 삶이 날로 피폐해 져 가는 사이, 나주 대부호의 서자로 조선 최고의 무관 출신인 조윤은 극악한 수법으로 양민들을 수탈,
                    삼남지방 최고의 대부호로 성장한다. 한편 소, 돼지를 잡아 근근이 살아가던 천한 백정 돌무치는 죽어도 잊지 못할 끔찍한 일을 당한 뒤 군도에 합류. 지리산 추설의 신 거성(新 巨星) 도치로 거듭난다.
                    망할 세상을 뒤집기 위해, 백성이 주인인 새 세상을 향해 도치를 필두로 한 군도는 백성의 적,
                    조윤과 한 판 승부를 시작하는데..."
                />
                <Movie
                    rank="10"
                    name="엣지 오브 투모로우"
                    image="https://movie-phinf.pstatic.net/20140616_233/1402884025598j42IR_JPEG/movie_image.jpg"
                    link="https://youtu.be/YzKSgXev9Yg"
                    release="2014.06.04."
                    audience={4706213}
                    tmeter={91} tscore={90}
                    mscore={71} mreview={8.6}
                    boxoffice={370541256}
                    award="14Critics' Choice 액션영화 여우주연상"
                    actor="톰 크루즈(빌 케이지), 에밀리 블런트(리타 브라타스키), 빌 팩스톤(파렐 상사)"
                    story="가까운 미래, 미믹이라 불리는 외계 종족의 침략으로 인류는 멸망 위기를 맞는다. 빌 케이지(톰 크루즈)는 자살 작전이나 다름없는 작전에 
                    훈련이나 장비를 제대로 갖추지 못한 상태로 배정되고 전투에 참여하자마자 죽음을 맞는다. 하지만 불가능한 일이 일어난다.
                    그가 다시 그 끔찍한 날이 시작된 시간에 다시 깨어나 다시 전투에 참여하게 되고 다시 죽었다가 또 다시 살아나는 것.
                    외계인과의 접촉으로 같은 시간대를 반복해서 겪게 되는 타임 루프에 갇히게 된 것이다."
                />
            </div>
        </div>
    );
}
export default List2014;