import React from 'react';
import './List.css';
import Movie from '../Movie';

function List2017() {
    return (
        <div className="list_longdiv">
            <div className="list_row">
                <Movie
                    rank="1"
                    name="신과함께- 죄와 벌 🥇"
                    image="https://movie-phinf.pstatic.net/20201230_252/1609304926719vwxpF_JPEG/movie_image.jpg"
                    link="https://youtu.be/5O5PVvHTWRo"
                    release="2017.12.20."
                    audience={14414658}
                    tmeter={67} tscore={82}
                    mscore={0} mreview={7.9}
                    boxoffice={109383911}
                    award="역대 국산영화 3위 / 2018 올해의 영화상"
                    actor="하정우(강림), 차태현(자홍), 주지훈(해원맥)"
                    story="저승 법에 의하면, 모든 인간은 사후 49일 동안 7번의 재판을 거쳐야만 한다. 살인, 나태, 거짓, 불의, 배신, 폭력, 천륜.
                    7개의 지옥에서 7번의 재판을 무사히 통과한 망자만이 환생하여 새로운 삶을 시작할 수 있다. “김자홍 씨께선, 오늘 예정 대로 무사히 사망하셨습니다.”
                    화재 사고 현장에서 여자아이를 구하고 죽음을 맞이한 소방관 자홍, 그의 앞에 저승차사 해원맥과 덕춘이 나타난다.
                    자신의 죽음이 아직 믿기지도 않는데 덕춘은 정의로운 망자이자 귀인이라며 그를 치켜세운다.
                    저승으로 가는 입구, 초군문에서 그를 기다리는 또 한 명의 차사 강림,
                    그는 차사들의 리더이자 앞으로 자홍이 겪어야 할 7개의 재판에서 변호를 맡아줄 변호사이기도 하다.
                    염라대왕에게 천년 동안 49명의 망자를 환생시키면 자신들 역시 인간으로 환생시켜 주겠다는 약속을 받은 삼차사들,
                    그들은 자신들이 변호하고 호위해야 하는 48번째 망자이자 19년 만에 나타난 의로운 귀인 자홍의 환생을 확신하지만,
                    각 지옥에서 자홍의 과거가 하나 둘씩 드러나면서 예상치 못한 고난과 맞닥뜨리는데…"
                />
                <Movie
                    rank="2"
                    name="택시운전사 🥈"
                    image="https://movie-phinf.pstatic.net/20170717_298/1500253295782rcIkE_JPEG/movie_image.jpg"
                    link="https://youtu.be/ZjVK09RDRY0"
                    release="2017.08.02."
                    audience={12189698}
                    tmeter={96} tscore={90}
                    mscore={69} mreview={8.6}
                    boxoffice={86252940}
                    award="17청룡, 대종상 최우수 작품상"
                    actor="출연송강호(김만섭), 토마스 크레취만(위르겐 힌츠페터), 유해진(황태술)"
                    story="택시운전사 만섭(송강호)은 외국손님을 태우고 광주에 갔다 통금 전에 돌아오면 밀린 월세를 갚을 수 있는 거금 10만원을 준다는 말에
                    독일기자 피터(토마스 크레취만)를 태우고 영문도 모른 채 길을 나선다. 광주 그리고 사람들. “모르겄어라, 우덜도 우덜한테 와 그라는지…”
                    어떻게든 택시비를 받아야 하는 만섭의 기지로 검문을 뚫고 겨우 들어선 광주. 위험하니 서울로 돌아가자는 만섭의 만류에도
                    피터는 대학생 재식(류준열)과 황기사(유해진)의 도움 속에 촬영을 시작한다. 그러나 상황은 점점 심각해지고 
                    만섭은 집에 혼자 있을 딸 걱정에 점점 초조해지는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="3"
                    name="공조 🥉"
                    image="https://movie-phinf.pstatic.net/20170118_143/1484714583493K148x_JPEG/movie_image.jpg"
                    link="https://youtu.be/g4qQXXtaMqc"
                    release="2017.01.18."
                    audience={7817654}
                    tmeter={0} tscore={62}
                    mscore={0} mreview={0}
                    boxoffice={55972241}
                    award="17백상예술대상 여자인기상"
                    actor="현빈(임철령), 유해진(강진태), 김주혁(차기성)"
                    story="비밀리에 제작된 위조 지폐 동판을 탈취하려는 내부 조직에 의해 작전 중 아내와 동료들을 잃게 된 특수 정예부대 출신의 북한형사 ‘림철령’(현빈).
                    동판을 찾아야만 하는 북한은 남한으로 숨어든 조직의 리더 ‘차기성’(김주혁)을 잡기 위해 역사상 최초의 남북 공조수사를 요청하고, 그 적임자로 철령을 서울에 파견한다.
                    한편, 북한의 속내가 의심스런 남한은 먼저 차기성을 잡기 위한 작전을 계획하고, 정직 처분 중인 생계형 형사 ‘강진태’(유해진)에게 공조수사를 위장한 철령의 밀착 감시를 지시한다.
                    임무를 완수해야 하는 철령과 임무를 막아야만 하는 진태. 그들에게 주어진 시간은 단 3일,
                    한 팀이 될 수 없는 남북 형사의 예측불가 공조수사가 시작된다!"
                />
                <Movie
                    rank="4"
                    name="스파이더맨: 홈커밍"
                    image="https://movie-phinf.pstatic.net/20170524_188/1495610958516Vt5jr_JPEG/movie_image.jpg"
                    link="https://youtu.be/8OqlQRlwlPk"
                    release="2017.07.05."
                    audience={7258678}
                    tmeter={92} tscore={87}
                    mscore={73} mreview={7.5}
                    boxoffice={880166924}
                    award="2017 세계 TOP 5"
                    actor="톰 홀랜드(피터 파커/스파이더맨), 마이클 키튼(아드리안 툼즈/벌처)"
                    story="‘시빌 워’ 당시 ‘토니 스타크’(로버트 다우니 주니어)에게 발탁되어 대단한 활약을 펼쳤던 스파이더맨 ‘피터 파커’(톰 홀랜드).
                    그에게 새로운 수트를 선물한 ‘토니 스타크’는 위험한 일은 하지 말라며 조언한다. 하지만 허세와 정의감으로 똘똘 뭉친 ‘피터 파커’는
                    세상을 위협하는 강력한 적 ‘벌처’(마이클 키튼)에 맞서려 하는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="5"
                    name="1987"
                    image="https://movie-phinf.pstatic.net/20171215_265/1513327177055W7qpm_JPEG/movie_image.jpg"
                    link="https://youtu.be/E7Dfq5ZLDv4"
                    release="2017.12.27."
                    audience={7232452}
                    tmeter={80} tscore={94}
                    mscore={0} mreview={0}
                    boxoffice={53834292}
                    award="18청룡 최우수 작품상 / 20백상 영화 대상"
                    actor="김윤석(박처장), 하정우(공안부장), 유해진(한병용)"
                    story="1987년 1월, 경찰 조사를 받던 스물두 살 대학생이 사망한다. 증거인멸을 위해 박처장(김윤석)의 주도 하에 경찰은 시신 화장을 요청하지만,
                    사망 당일 당직이었던 최검사(하정우)는 이를 거부하고 부검을 밀어붙인다. 단순 쇼크사인 것처럼 거짓 발표를 이어가는 경찰.
                    그러나 현장에 남은 흔적들과 부검 소견은 고문에 의한 사망을 가리키고, 사건을 취재하던 윤기자(이희준)는 ‘물고문 도중 질식사’를 보도한다.
                    이에 박처장은 조반장(박희순)등 형사 둘만 구속시키며 사건을 축소하려 한다. 한편, 교도소에 수감된 조반장을 통해 사건의 진상을 알게 된 교도관 한병용(유해진)은
                    이 사실을 수배 중인 재야인사에게 전달하기 위해 조카인 연희(김태리)에게 위험한 부탁을 하게 되는데…"
                />
                <Movie
                    rank="6"
                    name="범죄도시"
                    image="https://movie-phinf.pstatic.net/20170915_299/1505458505658vbKcN_JPEG/movie_image.jpg"
                    link="https://youtu.be/n-dYGqVVgU4"
                    release="2017.10.03."
                    audience={6880546}
                    tmeter={90} tscore={81}
                    mscore={0} mreview={0}
                    boxoffice={36313933}
                    award="18백상예술대상 신인감독상"
                    actor="마동석(마석도), 윤계상(장첸)"
                    story="2004년 서울… 하얼빈에서 넘어와 단숨에 기존 조직들을 장악하고 가장 강력한 세력인 춘식이파 보스 ‘황사장(조재윤 분)’까지 위협하며
                    도시 일대의 최강자로 급부상한 신흥범죄조직의 악랄한 보스 ‘장첸(윤계상 분)’. 대한민국을 뒤흔든 ‘장첸(윤계상 분)’ 일당을 잡기 위해
                    오직 주먹 한방으로 도시의 평화를 유지해 온 괴물형사 ‘마석도(마동석 분)’와 인간미 넘치는 든든한 리더 ‘전일만(최귀화 분)’ 반장이 이끄는 강력반은
                    나쁜 놈들을 한방에 쓸어버릴 끝.짱.나.는. 작전을 세우는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="7"
                    name="군함도"
                    image="https://movie-phinf.pstatic.net/20170726_24/1501035701931zYdMD_JPEG/movie_image.jpg"
                    link="https://youtu.be/By4fCsWj8Dk"
                    release="2017.07.26."
                    audience={6592168}
                    tmeter={62} tscore={81}
                    mscore={60} mreview={9.2}
                    boxoffice={46183383}
                    award="17한국영화제작가협회 음악상"
                    actor="황정민(이강옥), 소지섭(최칠성), 송중기(박무영)"
                    story="1945년 일제강점기. 경성 반도호텔 악단장 ‘강옥’(황정민)과 그의 하나뿐인 딸 ‘소희’(김수안). 그리고 종로 일대를 주름잡던 주먹 ‘칠성’(소지섭), 일제 치하에서 온갖 고초를 겪어온 ‘말년’(이정현) 등
                    각기 다른 사연을 품은 조선인들이 일본에서 돈을 벌 수 있다는 말에 속아 군함도로 향한다. 하지만 그들이 함께 탄 배가 도착한 곳은 조선인들을 강제 징용해 노동자로 착취하고 있던 ‘지옥섬’ 군함도였다.
                    영문도 모른 채 끌려온 조선인들이 해저 1,000 미터 깊이의 막장 속에서 매일 가스 폭발의 위험을 감수하며 노역해야 하는 군함도.
                    강옥은 어떻게 하든 일본인 관리의 비위를 맞춰 딸 소희만이라도 지키기 위해 온갖 수를 다하고, 칠성과 말년은 각자의 방식으로 고통스런 하루하루를 견뎌낸다.
                    한편 전쟁이 막바지로 치닫자 광복군 소속 OSS 요원 ‘무영’(송중기)은 독립운동의 주요인사 구출 작전을 지시 받고 군함도에 잠입한다.
                    일본 전역에 미국의 폭격이 시작되고 일본의 패색이 짙어지자 일본은 군함도에서 조선인에게 저지른 모든 만행을 은폐하기 위해 조선인들을 갱도에 가둔 채 폭파하려고 한다.
                    이를 눈치 챈 무영은, 강옥, 칠성, 말년을 비롯한 조선인 모두와 군함도를 빠져나가기로 결심하는데...!"
                />
                <Movie
                    rank="8"
                    name="청년경찰"
                    image="https://movie-phinf.pstatic.net/20170814_131/1502673994742txsKh_JPEG/movie_image.jpg"
                    link="https://youtu.be/uflYEv_0JoY"
                    release="2017.08.09."
                    audience={5653444}
                    tmeter={0} tscore={78}
                    mscore={0} mreview={0}
                    boxoffice={39730433}
                    award="17대종상, 평론가협회 신인남우상"
                    actor="박서준(기준), 강하늘(희열)"
                    story="의욕충만 경찰대생 기준(박서준) X 이론백단 경찰대생 희열(강하늘) 둘도 없는 친구인 두 사람은 외출을 나왔다 우연히 납치 사건을 목격하게 된다.
                    목격자는 오직 두 사람 뿐! 기준과 희열은 학교에서 배운 대로 지체 없이 경찰에 신고한다. 하지만 복잡한 절차와 부족한 증거로 수사는 전혀 진행될 기미가 보이지 않는 상황!
                    1분 1초가 급박한 상황에서 아까운 시간만 흘러가자, 기준과 희열은 직접 발로 뛰는 수사에 나서기로 하고 예측 불가능한 상황을 마주하게 되는데…"
                />
            </div>
            <div className="list_row">
                <Movie
                    rank="9"
                    name="더 킹"
                    image="https://movie-phinf.pstatic.net/20170118_172/1484704779507T3ahF_JPEG/movie_image.jpg"
                    link="https://youtu.be/cpHe62Z8_14"
                    release="2017.01.18."
                    audience={5318007}
                    tmeter={86} tscore={82}
                    mscore={0} mreview={0}
                    boxoffice={37886707}
                    award="17대종상 4관왕 / 17청룡영화상 3관왕"
                    actor="조인성(박태수), 정우성(한강식), 배성우(양동철)"
                    story="무소불위 권력을 쥐고 폼 나게 살고 싶었던 태수는 우여곡절 끝에 권력의 설계자 한강식을 만나
                    핵심 라인을 타고 승승장구 하게 된다 정권이 교체되는 중요한 시기, 새로운 판을 짜며 기회를 노리던 이들 앞에
                    예상치 못한 위기가 닥치는데…"
                />
                <Movie
                    rank="10"
                    name="미녀와 야수"
                    image="https://movie-phinf.pstatic.net/20170207_61/14864349974992zXL8_JPEG/movie_image.jpg"
                    link="https://youtu.be/n7LZA4Er7_g"
                    release="2017.03.16."
                    audience={5156372}
                    tmeter={71} tscore={80}
                    mscore={65} mreview={6.7}
                    boxoffice={1273576220}
                    award="2017 세계 TOP 2 / 역대 뮤지컬 박스오피스 1위"
                    actor="엠마 왓슨(벨), 댄 스티븐스(야수/왕자), 루크 에반스(개스톤)"
                    story="똑똑하고 아름다운 ‘벨(엠마 왓슨)’은 아버지와 살고 있는 작은 마을에서 벗어나 운명적인 사랑과 모험을 꿈꾼다.
                    어느 날 행방불명된 아버지를 찾아 폐허가 된 성에 도착한 벨은 저주에 걸린 ‘야수’(댄 스티븐스)를 만나
                    아버지 대신 성에 갇히고, 야수 뿐 아니라 성 안의 모든 이들이 신비로운 장미의 마지막 꽃잎이 떨어지기 전에
                    저주를 풀지 못하면 영원히 인간으로 돌아올 수 없는 운명임을 알게 된다. 성에서 도망치려던 벨은 위험한 상황에서 자신을 보호해 준 야수의 진심을 알게 되면서
                    차츰 마음을 열어가기 시작하는데…"
                />
            </div>
        </div>
    );
}
export default List2017;